[
  {
    "id": "saying_No_262",
    "title": "saying No. 262",
    "text": "-1 and pointed out that this title was given to Imam \nAli ibn Abu Talib (x) by the Holy Prophet himself. We quoted some of his \ndifferent statements on this subject. Here we quote one of the traditions in which \nthis word appears. It is narrated by Abu Layla al-Ghifari, Abu Dharr, Salman, \n327. Some Jews said to Imam Ali ibn Abu Talib (x): “You did \nnot bury your Prophet when you picked up differences about him.” It is \nthen that Imam Ali ibn Abu Talib (x) replied thus: “We did not differ \nabout him; we differed after him (i.e. about his succession). You had not \ndried up your feet yet, having come out of the river, when you began \nasking your Prophet: ‘Make you for us a god as they have gods of their \nown.’ Said he; ‘Verily you are a people behaving ignorantly’ (Quran, 7: \n138).”273\n328. Imam Ali ibn Abu Talib (x) was asked: “With what did you \noverpower your adversaries?” He answered: \n \n “Whenever I confronted one of them, he helped me against \nhimself.”\n \nIbn Abbas and Hudhayfah ibn al-Yaman. It states that the Holy Prophet used to \nsay: “Soon after my death, there will be discord. When it occurs, uphold Ali ibn \nAbu Talib since he will be the first person to see me and the first to shake hands \nwith me on the Day of Judgement. He is the greatest man of the truth (as-siddiq \nal-akbar), and he is the one who discriminates between right and wrong (faruq)\nfrom among this ummah, and he is the ya‘sub (leader) of the believers while \nwealth is the ya‘sub of the hypocrites. (In addition to the references given in the \nabove-mentioned footnote, see also Fayd al-Qadir, Vol. 4, p. 358; Kanz al-\nUmmal, Vol. 12, p. 214; Muntakhab al-Kanz, Vol. 5, p. 33; Ibn Abul-Hadid, \nVol. 13, p. 228; Tarikh, Ibn ‘Asakir (where the biography of Imam Ali ibn Abu \nTalib [x] is discussed), Vol. 1, pp. 74-78; As-Sirah al-Halabiyyah, Vol. 1, p. \n380; Thakha’ir al-‘Uqba, p. 56; Yanabi‘ al-Mawaddah, p. 62, 82, 201 and 251). \n273The purpose behind this criticism by the Jews was to show that the \nProphethood of Prophet Muhammad (k) was a controversial matter. But Imam \nAli ibn Abu Talib (x) clarified the fact that the exact focus of controversy was \nnot about his Prophethood but about his succession and vicegerency. Then, \ncommenting on the status of the Jews, he pointed out that those who were today \ncriticizing the mutual differences among Muslims after the Prophet were of the \nsame kind as those who had begun to waver about belief in the Unity of Allah \neven during the lifetime of Moses (x). Thus, when, on becoming free of the \nslavery of the Egyptians they reached the other side of the river and saw the \nfigure of a calf in a temple in the Sinai desert, they asked Moses to get a similar \nfigure for them, whereupon Moses rebuked them for being still as stubborn as \nthey were in Egypt. This meant that people who were so immersed in their \ndesire for idol-worship that even after being initiated into the belief in the Unity \nof Allah, they still became restless on seeing an idol and made the request for a \nsimilar idol to be made for themselves. Such people had no right to criticize any \ndifferences among the Muslims. \nSayyid ar-Radi says: “Imam Ali ibn Abu Talib (x) is pointing out \nhis striking of awe in the hearts.”274\n \n \n329. Imam Ali ibn Abu Talib (x) said to his son Muhammad ibn \nal-Hanafiyyah: “O my son! I fear lest destitution overtakes you. So, you \nshould seek Allah’s protection from it because destitution is [an indication \nof] a deficiency in religious beliefs, perplexity of intelligence, and it is \nconducive to hatred of obstinate people.” \n \n \n330. Imam Ali ibn Abu Talib (x) replied to a man who had asked \nhim a difficult question with the following: Ask me for understanding but \ndo not ask for confusion because the ignorant person who tries to learn is \nlike the learned man, but the learned man who tries to create confusion is \nlike the ignorant. \n \n \n331. Abdullah ibn Abbas once advised Imam Ali ibn Abu Talib \n(x) against his views, so the Imam (x) said: You have only to advise me, \nbut then I have to see (what to do), and if I act against your advice, you \nhave to follow me.275\n \n \n352. Imam Ali ibn Abu Talib (x) returned to Kufa from Siffin, he \npassed by the residences of the Shibamites (who belonged to the tribe of \nShibam) and heard their women mourning those killed in Siffin. At that \ntime, a Shibamite, namely Harb ibn Shurahbil ash-Shibami, who was one \nof the nobles of those people, went to him. Imam Ali ibn Abu Talib (x)\n \n274The man who is over-awed by his adversary is sure to be defeated \nbecause in facing a foe, physical prowess is not enough but steadfastness of \nheart and strength of courage are also necessary. When the adversary loses \ncourage and feels sure that he will be defeated, he will certainly then be \ndefeated. This is what happened to the adversary of Imam Ali ibn Abu Talib (x);\nhe was so affected by his acknowledged reputation that he was sure of his own \ndeath, in consequence of which his spiritual power and self-confidence came to \nan end and eventually this mental state dragged him to his own death. \n275‘Abdullah ibn al-Abbas had advised Imam Ali ibn Abu Talib (x) to \nissue a letter of appointment to Talhah and az-Zubayr as the Governors of Kufa \nand to retain Mu‘awiyah as the Governor of Syria till such time as his status \nbecame stabilized and the government gained strength. In reply, Imam Ali ibn \nAbu Talib (x) said that he could not expose his own religion to danger for the \nsake of the worldly benefit of others, adding that “Instead of insisting on your \nown point of view, you should listen to me and obey me.” \nsaid to him, “Do your women have control over you as regarding the \nweeping that I hear? Do you not refrain them from such crying?” Harb \nbegan to walk with him while Imam Ali ibn Abu Talib (x) was on \nhorseback, so Imam Ali ibn Abu Talib (x) said to him: “Get back because \nthe walking of a man like you with one like me is mischief for the ruler \nand a disgrace for the believer.” \n \n \n333. Imam Ali ibn Abu Talib (x) passed by the dead bodies of the \nKharijites on the day of the battle of Nahrawan and said: “Woe unto you! \nYou have been harmed by him who deceived you.” He was asked: “O \nImam Ali ibn Abu Talib (x)! Who deceived them?” He replied: “Satan, \nthe deceiver, and the inner self [nafs] that leads one to evil deceived them \nthrough passions. It made it easy for them to get into sins, promised them \nvictory and eventually threw them into the Fire.” \n \n \n334. Imam Ali ibn Abu Talib (x) said: Beware of disobeying \nAllah in solitude because the Witness (of that situation) is also the Judge. \n \n \n335. When the news of the killing of Muhammad ibn Abu Bakr \nreached Imam Ali ibn Abu Talib (x), he said: Our grief over him is as \ngreat as their (i.e. the enemy’s) joy for it, except that they have lost an \nenemy and we have lost a friend. \n \n \nIn the year 38 A.H., Mu`awiyah sent ‘Amr ibn al-As to Egypt \nwith a large force. ‘Amr ibn al-As called upon Mu’awiyah ibn Hudayj for \nassistance. They brought together the supporters of Othman and waged a \nwar against Muhammad ibn Abu Bakr (son of caliph Abu Bakr), \ncapturing him. Mu’awiyah ibn Hudayj beheaded him. Stitching his body \ninto the belly of a dead ass, he burnt his corpse... Muhammad was at that \ntime twenty-eight years old. It is reported that when the news of this \ntragedy reached his mother, she fell onto a great rage and indignation. \nAisha, his paternal sister, took a vow that, as long as she lived, she would \nnever eat roasted meat. Since then, she used to curse Mu’awiyah ibn Abu \nSufyan, ‘Amr ibn al-As and Mu’awiyah ibn Hudayj after every prayer. \n \n \nWhen Imam Ali ibn Abu Talib (x) heard the news of \nMuhammad’s martyrdom, he became immensely sad. He wrote in a very \nsomber language to Ibn ‘Abbas who was in Basra about the tragic death \nof Muhammad ibn Abu Bakr. \nHearing the news of Muhammad’s martyrdom, Ibn Abbas came \nfrom Basra to Kufa to offer his condolences to Imam Ali ibn Abu Talib \n(x).\n \n \nOne of the official informers of Imam Ali ibn Abu Talib (x) came \nfrom Syria and said: “O Imam Ali ibn Abu Talib (x)! When the news of \nMuhammad’s murder reached Mu’awiyah, he went to the pulpit and \npraised the group that took part in his martyrdom. The people of Syria \nrejoiced so much at hearing the news that I had never seen them in such \nan elated mood before.” It was then that Imam Ali ibn Abu Talib (x)\nuttered the above saying. He further said that although Muhammad was \nhis step-son, he was like his own son (at-Tabari, Vol. 1, pp. 3400-3414; \nIbn al-Athir, Vol. 3, pp. 352-359; Ibn Kathir, Vol. 7, pp. 313-317; Abul-\nFida’, Vol. 1, p. 179; Ibn Abul-Hadid, Vol. 6, pp. 82-100; Ibn Khaldun, \nVol. 2, part 2, pp. 181-182; Al-Isti`ab, Vol. 3, pp. 1366-1367; Al-Isabah, \nVol. 3, pp. 472-473; Al-Gharat, at-Thaqafi, Vol. 1, pp. 276-322; Tarikh \nal-Khamis, Vol. 2, pp. 238-239). \n \n \nWe have written before (in the footnote to Sermon n.67) \nconcerning the biography of Muhammad ibn Abu Bakr. \n \n \n336. Imam Ali ibn Abu Talib (x) said: The age up to which Allah \naccepts any excuse for a human being is sixty years. \n \n \n337. Imam Ali ibn Abu Talib (x) said: One whose sin overpowers \nhim is never victorious, and whoever secures victory by evil means is (in \nfact) vanquished. \n \n \n338. Imam Ali ibn Abu Talib (x) said: Allah, the Glorified One, \nhas fixed the livelihood of the destitute in the wealth of the rich. \nConsequently, whenever a destitute remains hungry, it is because some \nrich person has denied (him his share). Allah, the Sublime, will question \nthem [the rich] about it. \n \n \n339. Imam Ali ibn Abu Talib (x) said: Not to be in need of \nputting forth an excuse is better than putting forth a true excuse.276\n \n276The meaning here is that obligations should be carried out so that \nthere is no occasion for putting forth excuses. After all, in making excuses, there \nis a hint for shortcomings and perhaps a sense of humiliation. \n340. Imam Ali ibn Abu Talib (x) said: The least right of Allah on you \nis that you should not make use of His favors in committing His sins.277\n \n \n341. Imam Ali ibn Abu Talib (x) said: When the disabled fall \nshort in performing acts of obedience to Allah, the Glorified One, it is a \ngood opportunity given by Allah for the intelligent to perform such acts. \n \n \n342. Imam Ali ibn Abu Talib (x) said: The sovereign is the \nwatchman of Allah on earth. \n \n \n343. Describing a believer, Imam Ali ibn Abu Talib (x) said: A \nbeliever has a cheerful face, a sorrowful heart, a very broad chest (very \ngenerous), and a very humble heart. He hates high status and dislikes \nfame. His grief is long, his courage is far-reaching, his silence is much \nand, his time is occupied. He is grateful, enduring, buried in his thoughts, \nsparing in his friendship (with others), of a bright demeanor and of a soft \ntemperament. He is stronger than stone but more humble than a slave. \n \n \n344. Imam Ali ibn Abu Talib (x) said: If a man happens to see the \nend of (his) life and his final fate, he will begin hating desires and their \ndeception.\n \n \n345. Imam Ali ibn Abu Talib (x) said: There are two shares in the \nproperty of every person: heirs and accidents. \n \n \n346. Imam Ali ibn Abu Talib (x) said: The person who is \napproached with a request is free till he makes a promise. \n \n \n347. Imam Ali ibn AbÅ Talib (x) said: Whoever prays but does \nnot exert effort is like one who shoots without a bow-string. \n \n277There are a few grades of denial of favors and ingratitude. The first is \nthat a person may not be able to appreciate (the real significance of) a favor. For \nexample, the vision of the eyes, the speech of the tongue, the hearing of the ears \nand the movements of the limbs. These are all favors bestowed by Allah, but \nmany people do not realize them to be favors and do not entertain feelings of \ngratitude, taking them for granted. The second grade is that a person may see a \nfavor and appreciate it but may not feel grateful for it. The third grade is that a \nperson may oppose the One Who bestows the favors. The fourth grade is that \ninstead of using the favors granted by Him, a person may use them in \ncommitting sins against Allah. This is the highest grade of denial of favors, i.e. \nof ingratitude. \n348. Imam Ali ibn Abu Talib (x) said: Knowledge is of two \nkinds: that which is absorbed and that which is just heard. The one that is \nheard does not give benefit unless it is absorbed. \n \n \n349. Imam Ali ibn Abu Talib (x) said: Correctness of decisions \ngoes together with power. One emerges with the other’s emergence and \ndisappears when the other disappears.278\n \n \n350. Imam Ali ibn Abu Talib (x) said: The beauty of destitution \nis chastity and the beauty of riches is gratitude. \n \n \n351. Imam Ali ibn Abu Talib (x) said: The day of justice will be \nmore severe on the oppressor than the day of oppression on the oppressed. \n \n \n352. Imam Ali ibn Abu Talib (x) said: The biggest wealth is that \none should not have an eye on what others possess. \n \n \n353. Imam Ali ibn Abu Talib (x) said: Utterances are preserved \nand actions are to be tired. “Every soul, for what it earned, is pawned” \n(Quran, 74: 38). People are to be made deficient (as regarding their \nbodies) and meddled with (as regarding their minds) except those whom \nAllah protects. The ones who inquires from among them aims at \nconfusing, while the one who answers creates hardship. It is possible that \nthe man who has the best views among them will be deviated from the \nsoundness of his thinking by pleasure or displeasure, and it is possible \nthat a single glance may affect even the man with the best wisdom from \namong them or a single expression may transform him. \n \n \n354. Imam Ali ibn Abu Talib (x) said: O folks! Fear Allah, for \nthere is many a man who aspires for what he does not get, many a builder \nof a house who does not live to occupy it, and many a collector of that \n \n278When anyone’s star is auspicious and his luck is good, he steps \nautomatically towards the goal in view, and his mind confronts no perplexity in \ndetermining the correct way of approach. But the person whose luck is about to \nebb stumbles even in the light and his mental faculties become paralyzed. \nConsequently, when the downfall of the Barmakids began, ten persons from \namong them assembled for consultation about a matter but were not able to take \na decision even after a long discussion. Seeing this, Yahya [the Barmaki] said, \n“By Allah! It is a forerunner of our decline and a sign of our downfall that even \nten of us have not been able to settle a matter, although when we were in \nascendancy, just one of us could easily solve ten problems.” \nwhich he shall just leave behind. Possibly he may have collected it \nwrongfully or by denying one’s right. He acquired it unlawfully and had \nto bear the weight of sins on its account. Consequently, he returned (from \nthis world) with that weight and came before Allah with sorrow and grief. \n“He lost this world and (also) the thereafter; that is a loss (which is) \nmanifest” (Quran, 22: 11). \n \n \n355. Imam Ali ibn Abu Talib (x) said: Lack of access to sins is \nalso a kind of chastity. \n \n \n356. Imam Ali ibn Abu Talib (x) said: The dignity of your face is \nsolid, but begging dissolves it; therefore, look carefully before whom you \ndissolve it. \n \n \n357. Imam Ali ibn Abu Talib (x) said: To praise more than what \nis due is sycophancy; to do it less is either because of inability to speak or \nof envy. \n \n \n358. Imam Ali ibn Abu Talib (x) peace be upon one who keeps \naway even from minor sins and, hence, his burden is considered light.279\n \n \n359. Imam Ali ibn Abu Talib (x) said: One who sees his own \nshortcomings abstains from looking into other’s shortcomings. Whoever \nfeels happy with the livelihood with which Allah provides him does not \ngrieve over what he misses. Whoever draws out the sword of rebellion \ngets killed by it. Whoever strives without means perishes. Whoever enters \nthe depths gets drowned. Whoever visits places of ill-repute receives \nblame. \n \n \nWhoever speaks more commits more errors. Whoever commits \nmore errors becomes shameless. Whoever is shameless will have less fear \nof Allah. Anyone who decreases his fear of Allah causes his heart to die. \nOne whose heart dies enters the Fire. Whoever observes the shortcomings \nof others and disapproves of them then accepts them for himself is \ndefinitely a fool. Contentment is a capital that does not dwindle. Whoever \n \n279The result of lack of restraint and care with regard to small sins is \nthat a man becomes rather careless in the matter of sins and, by and by, this \nhabit produces boldness to commit larger sins. Then he begins to commit them \nwithout hesitation. Therefore, one should regard small sins as a harbinger of \nbigger sins and should avoid them so that the stage for committing big sins will \nnot materialize. \nremembers death much is satisfied with small favors in this world. \nWhoever knows that his speech is also a part of his action speaks less \nexcept where he has some purpose. \n \n \n360. Imam Ali ibn Abu Talib (x) said: The oppressor among the \npeople has three signs: He oppresses his superior by disobeying him, and \nhis junior by imposing his authority and he tops other oppressors. \n \n \n361. Imam Ali ibn Abu Talib (x) said: At the extremity of \nhardship comes relief, and at the tightening of the chains of tribulation \ncomes ease. \n \n \n362. Imam Ali ibn Abu Talib (x) said the following to one of his \ncompanions: Do not devote much of your activity to your wife and \nchildren because if your wife and children are lovers of Allah, then He \nwill not leave His lovers without caring for them. And if they are enemies \nof Allah, then why should you worry and keep yourself busy about the \nenemies of Allah? \n \n \n363. Imam Ali ibn Abu Talib (x) said: The greatest defect is \nwhen you are concerned about the defect (in others) which is already \npresent in yourself.280\n \n \n364. Someone congratulated another person in the presence of \nImam Ali ibn Abu Talib (x) on the birth of a son saying: “Congratulations \nfor getting a rider of horses” Imam Ali ibn Abu Talib (x), said: Do not say \nso; but say: You have an occasion to be grateful to Allah, the Giver, and \nbe blessed with what you have been given. May he attain full life, and \nmay you be blessed with His devotion. \n \n \n365. One of the officers of Imam Ali ibn Abu Talib (x) built a \nstately house about which Imam Ali ibn Abu Talib (x) said: These are \nsilver coins showing their faces. Certainly, this house speaks of your \nriches.\n \n280What a worse defect can there be that a man should criticize those \ndefects in others which exist in himself? The requirement of justice is that \nbefore casting one’s eye on the defects of others, one should look at his own \ndefects and realize that a defect is a defect whether it is in others or in himself. A \nPersian couplet says: “Looking at other’s defects is neither property nor \nmanliness. Better look at your own self since you are full of defects.” \n366. It was said to Imam Ali ibn Abu Talib (x), peace be upon \nhim: “If a man is left in his house and the door is closed, from where will \nhis livelihood reach him?” He replied: “From whatever way his death \nreaches him.”281\n \n \nThe meaning is that a man should be content in the matter of \nlivelihood because whatever is destined for him will in any case reach \nhim wherever he may be. \n \n \nA Persian couplet says: “Livelihood, like death, will reach a man \neven if the door is closed, but greed keeps people (unnecessarily) \nanxious.”\n \n \n367. Offering condolences to people one of whom had just died, \nImam Ali ibn Abu Talib (x) said: This thing has not started with you nor \ndoes it end with you. This fellow of yours was used to journeying and, \ntherefore, it is better to think of him as still journeying. Either he will \nrejoin you or you will rejoin him. \n \n \n368. Imam Ali ibn Abu Talib (x) said: O people! Let Allah see \nyou fearing at the time of happiness just as you fear Him at the time of \ndistress. Certainly, whoever is given ease (of life) and does not consider it \nas a means of slow approach to tribulation (wrongly) considers himself as \nsafe against what is to be feared while whoever is afflicted with straitened \ncircumstances but does not perceive them to be a trial loses to a coveted \nreward.\n \n \n369. Imam Ali ibn Abu Talib (x) said: O slaves of desires! Cut \nthem short because whoever leans on the world gets nothing out of it \nexcept the pain of hardships. O people! Take upon yourselves to train \nyour own souls and turn away from the dictates of your natural \ninclinations.\n \n281If Allah considers it appropriate to keep a man living while he is \nconfined to a closed house, then He is certainly powerful enough to provide the \nmeans of living to him. Just as a closed door cannot prevent death, in the same \nway, it cannot prevent the entry of livelihood because the Might of Allah, the \nAlmighty, is equally capable of either. \n370. Imam Ali ibn Abu Talib (x) said: Do not regard an \nexpression uttered by any person as evil if you can find it capable of \nbearing some good. \n \n \n371. Imam Ali ibn Abu Talib (x) said: If you have a need from \nAllah, the Glorified One, then begin by seeking Allah’s blessing on His \nMessenger, may Allah bless him and his descendants, then ask your need, \nbecause Allah is too generous to accept one (seeking His blessing on His \nMessenger) of the two requests made to Him while denying the other. \n \n \n372. Imam Ali ibn Abu Talib (x) said: Whoever is jealous of his \nesteem should keep from quarreling. \n \n \n373. Imam Ali ibn Abu Talib (x) said: To make haste before the \nproper time or to delay after a proper opportunity, in either case there is \nfolly. \n \n \n374. Imam Ali ibn Abu Talib (x) said: Do not ask about things \nwhich may not happen because you have enough to worry about with \nwhat already happens. \n \n \n375. Imam Ali ibn Abu Talib (x) said: Imagination is a clear \nmirror, and the taking of lessons (from things around you) provides \nwarning and counsel. It is enough for improving yourself that you should \navoid what you consider as bad in others. \n \n \n376. Imam Ali ibn Abu Talib (x) said: Knowledge is associated \nwith action. Therefore, whoever knows should act [upon it] because \nknowledge calls for action. If there is a response, well and good; \notherwise, it (i.e. knowledge) departs from him. \n \n \n377. Imam Ali ibn Abu Talib (x) said: O people! The wealth of \nthis world is broken into sorts that may bring an epidemic; therefore, keep \noff this grazing land. Leaving it is a greater favor than peacefully staying \nin it, and its part which suffices for subsistence is more blissful than its \nriches. Destitution has been ordained for those who are rich here, while \ncomfort has been designated for those who keep away from it. If a person \nis attracted by its dazzle, it blinds both his eyes. And if a person acquires \neagerness towards it, it fills his heart with grief which keeps alternating in \nthe black part of his heart, some grief worrying him and another giving \nhim pain. This goes on till the suffocation of death overtakes him. He is \nflung in the open while both the shrines of his heart are severed. It is easy \nfor Allah to cause him to die and for his comrades to put him in the grave. \n \n \nThe believer sees the world with eyes that derive instruction and \ntakes from it food enough for his barest needs. He hears in it with ears of \nhatred and enmity [towards this world]. If it is said (about someone) that \nhe has become rich, it is also said that he has turned destitute. And if \npleasure is felt on one’s own living, grief is felt over his death. This is the \nstatus, although the day has not yet approached when they will be \ndisheartened.\n \n \n378. Imam Ali ibn Abu Talib (x) said: Allah, the Glorified One, \nhas laid down rewards for obedience to Him and punishment for \ncommitting sins against Him in order to save men from His chastisement \nand to drive them towards Paradise. \n \n \n379. Imam Ali ibn Abu Talib (x) said: A time will come when \nnothing will remain of the Qur’an except its writing and nothing of Islam \nexcept its name. The mosques in such days will be busy with regard to \nconstruction but desolate with regard to guidance. Those staying in them \nand those visiting them will be the worst of all people on earth. From \nthem, mischief will spring up and, toward them, all wrong will turn. If \nanyone isolates himself from it (mischief), they will fling him back into it. \nAnd if anyone steps back from it, they will push him towards it. Says \nAllah, the Glorified One, (in one hadith qudsi, i.e. the tradition in which \nAllah Himself speaks): I swear by Myself that I shall send upon them an \nevil wherein the one who endures will be bewildered,” and He will do so. \nWe seek Allah’s pardon against stumbling through neglect. \n \n \n380. It is related that seldom did Imam Ali ibn Abu Talib (x)\nascend the pulpit without uttering the following statement before starting \nhis sermon: O people! Fear Allah, for man has not been created for naught \nso that he may waste himself, nor has he been left without anyone caring \nfor them so that he may commit foolish acts. This world, which appears to \nhim to be beautiful cannot be the replacement for the next which appears \nin his eyes to be bad, nor is the vain person, who is successful in this \nworld, is sure that he will prosper in the next even to a small extent. \n \n \n381. Imam Ali ibn Abu Talib (x) said: There is no distinction \nhigher than Islam, no honor more honorable than fear of Allah, no asylum \nbetter than self-restraint, no intercessor more effective than repentance, no \ntreasure more precious than contentment, and no wealth is a bigger \nremover of destitution than satisfaction with mere subsistence. Whoever \nconfines himself to what is just enough for maintenance achieves comfort \nand prepares his abode in ease. Desire is the key of grief and the \nconveyance of distress. Greed, vanity and jealousy are incentives to \nfalling into sins and mischief-making, the collection of all bad habits. \n \n \n382. Imam Ali ibn Abu Talib (x) said the following to Jabir ibn \n‘Abdullah al-Ansari: O Jabir! The mainstay of religion and the world are \nfour persons: The scholar who acts upon his knowledge, the ignorant \nperson who does not feel ashamed of learning, the generous person who is \nnot niggardly in his favors, and the destitute who does not sell his next \nlife for his worldly benefits. Consequently, when the scholar wastes his \nknowledge, the ignorant feels too ashamed to learn, and when the \ngenerous is niggardly with his favors, the destitute sells his next life for \nthe worldly benefits. \n \n \nO Jabir! If favors of Allah abound on a person, the people’s needs \ntoward him also abound. Therefore, whoever fulfills for Allah all that is \nobligatory on him in this regard will preserve them (Allah’s favors) in \ncontinuance and perpetuity, while whoever does not fulfil those \nobligations will expose them to decay and destruction. \n \n \n383. Ibn Jarir at-Tabari has, in his History (Vol. 2, p. 1086; also \nIbn al-Athir in his History, Vol. 4, p. 478) related from ‘Abd ar-Rahman \nibn Abu Layla, al-faqih, who was one of those who had risen with (‘Abd \nar-Rahman ibn Muhammad) Ibn al-Ash‘ath to fight al-Hajjaj (ibn Yusuf \nath-Thaqafi), that he (Ibn Abu Layla) was exhorting people to carry out \njihad by recalling the following: “On the occasion of the encounter with \nthe people of Syria, I heard Imam Ali ibn Abu Talib (x), may Allah exalt \nhis rank among the righteous and may He reward him with the reward of \nmartyrs and men of truth, saying: ‘O believers, whoever observes \nexcesses being committed and people being called towards evil and \ndisapproves it with his heart is safe and free from responsibility for it, and \nwhoever disapproves of it with his tongue will be rewarded and he is in a \nhigher status than the former, but whoever disapproves it with his sword \nin order that the word of Allah may remain superior and the word of the \noppressors may remain inferior, catches hold of the path of guidance and \nstands on the right way, while his heart is lit with conviction.’” \n \n \n384. Another saying in the same strain runs as follows: So..., \namong them (the Muslim community) there is one who disapproves evil \nwith his hand, tongue and heart. This man has perfectly attained the \nvirtuous habits. And among them there is one who disapproves evil with \nhis tongue and heart but not with his hand. This man has attained only \ntwo virtuous habits but lacks one. And among them there is the third who \ndisapproves evil with his heart but not with his tongue and hand. This is \nthe one who lacks the two better qualities out of the three and holds only \none. Then, among them there is also one who does not disprove evil with \nhis tongue, heart or hand. He is just a dead man among the living. \n \n \nAll the virtuous acts, including waging a war in the way of Allah, \nas compared to the persuasion for good and dissuasion from evil, are just \nlike spitting in the deep ocean [i.e. of no consequence]. The acts of \npersuasion for good and dissuasion from evil do not bring death nearer, \nnor do they lessen the livelihood. And better than all this is to utter a just \nexpression before a tyrannical ruler. \n \n \n385. The following is related from Abu Juhayfah who said, “I \nheard Imam Ali ibn Abu Talib (x) saying: The first fighting with which \nyou will be overpowered is fighting with the hands. Thereafter, you will \nfight with your tongues then with your hearts. Consequently, whoever \ndoes not recognize virtue with his heart or does not disprove evil will be \nturned upside down. Thus, his upside will be turned downwards and his \nlow side will be turned upwards. \n \n \n386. Imam Ali ibn Abu Talib (x) said: Certainly, right is weighty \nand wholesome while wrong is light and epidemic. \n \n \n387. Imam Ali ibn Abu Talib (x) said: Do not feel safe from the \npunishment of Allah even about the best man in the whole community \nbecause Allah, the Sublime, says: “But none feels secure from the plan of \nAllah save the people (who are the) losers” (Quran, 7: 99). Again, do not \nlose hope even for the worst man of the community because Allah, the \nSublime One, says: “Verily, none despair from Allah’s mercy save the \ndisbelieving people” (Quran, 12: 87). \n \n \n388. Imam Ali ibn Abu Talib (x) said: Miserliness contains all \nother evil vices and is the rein with which one can be led to every evil. \n \n \n389. Imam Ali ibn Abu Talib (x) said: O son of Adam! \nLivelihood is of two kinds: The livelihood which you seek and the \nlivelihood which seeks you; if you do not reach it, it will reach you. \nTherefore, do not turn your one day’s worry into a year’s worry. \nWhatever you get every day should be enough for you for the day. If you \nhave a whole year of your life, even then Allah, the Sublime, will give \nyou every next day what He has destined as your share. If you do not have \na year in your life-span, then why should you worry for what is not for \nyou? No seeker will reach your livelihood before you, nor will anyone \noverpower you in the matter of livelihood. Likewise, whatever has been \ndestined as your share will not be delayed for you. \n \n \nSayyid ar-Radi says: “This statement has already appeared \nelsewhere in this Chapter except that here it is clearer and more detailed. \nThis is why we have repeated it according to the principle laid down in \nthe beginning of the book.” \n \n \n390. Imam Ali ibn Abu Talib (x) said: Many a man faces a day \nafter which he finds no day, and many a man is in an enviable status in \nthe earlier part of the night but is mourned by wailing women in its later \npart.\n \n \n391. Imam Ali ibn Abu Talib (x) said: Words are in your control \ntill you have not uttered them. But when you have spoken them, you are \nunder their control. Therefore, guard your tongue as you guard your gold \nand silver, for often one expression snatches away a blessing and invites a \npenalty.\n \n \n392. Imam Ali ibn Abu Talib (x) said: Do not say what you do \nnot know; rather, do not say all that you know because Allah has laid \ndown some obligations for all your limbs by means of which He will put \nforth arguments against you on the Day of Judgement. \n \n \n393. Imam Ali ibn Abu Talib (x) said: Fear lest Allah should see \nyou committing His sins or misses you when it is time to obey Him and, \nas a result, you will become a loser. Therefore, when you are strong, be \nstrong in obeying Allah, and when you are weak, be weak in committing \nsins against Allah. \n \n \n394. Imam Ali ibn Abu Talib (x) said: Leaning towards this \nworld despite what you see of it is a folly, and lagging behind in doing \ngood deeds when you are convinced of good reward for them is an \nobvious loss, while trusting in everyone before trying is a weakness. \n395. Imam Ali ibn Abu Talib (x) said: It is (the proof of the) \nhumbleness of the world before Allah that He is disobeyed only herein \nand His favors cannot be achieved except by renouncing it. \n \n \n396. Imam Ali ibn Abu Talib (x) said: One who is in search of \nsomething will obtain it, at least some of it. \n \n \n397. Imam Ali ibn Abu Talib (x) said: That good is no good after \nwhich there is the Fire, and that hardship is no hardship after which there \nis Paradise. Every bliss other than Paradise is minor, and every calamity \nother than the Fire is comfort. \n \n \n398. Imam Ali ibn Abu Talib (x) said: Beware that destitution is a \ncalamity, but worse than destitution is ailment of the body, while worse \nthan bodily ailment is the disease of the heart. Beware that plenty of \nwealth is a blessing, but better than plenty of wealth is the health of the \nbody, while still better than the health of the body is the purity of the \nheart.\n \n \n399. Imam Ali ibn Abu Talib (x) said: “Anyone whose his action \nkeeps him behind, his lineage cannot push him forward.” In another \nversion, it is expressed thus: “Whoever misses his own personal \nattainments cannot gain any benefit from his forefathers’ attainments.” \n \n \n400. Imam Ali ibn Abu Talib (x) said: The believer’s time has \nthree periods: The period when he is in communion with Allah, the period \nwhen he manages for his livelihood, and the period when he is free to \nenjoy what is lawful and pleasant. It does not behoove a wise person to be \naway (from his house) save for three matters, namely: for the purposes of \nlearning, or going for something for the next life, or for enjoying what is \nnot prohibited. \n \n \n401. Imam Ali ibn Abu Talib (x) said: Abstain from the world so \nthat Allah may show you its real evils, and do not be neglectful because \n(in any case) you will not be neglected. \n \n \n402. Imam Ali ibn Abu Talib (x) said: Speak so that you may be \nknown, since man is hidden under his tongue. \n403. Imam Ali ibn Abu Talib (x) said: Take of the favors of the \nworld whatever comes to you and keep away from what keeps away from \nyou. If you cannot do so, be moderate in your pursuits. \n \n \n404. Imam Ali ibn Abu Talib (x) said: Many an expression is \nmore effective than an onslaught. \n \n \n405. Imam Ali ibn Abu Talib (x) said: Every small thing that is \ncontented upon suffices. \n \n \n406. Imam Ali ibn Abu Talib (x) said: Let it be death but not \nhumiliation. Let it be little but not through others. Whoever does not get \nwhile sitting will not get by standing either. The world has two days: one \nfor you and the other against you. When the day is for you, do not feel \nproud, but when it is against you, endure it. \n \n \n407. Imam Ali ibn Abu Talib (x) said: The best scent is musk, its \nweight is light while its smell is sweet. \n \n \n408. Imam Ali ibn Abu Talib (x) said: Put off boasting, give up \nself-conceit and remember your grave. \n \n \n409. Imam Ali ibn Abu Talib (x) said: The child has a right on \nthe father while the father, too, has a right on the child. The right of the \nfather on the child is that the latter should obey the former in every matter \nsave in committing sins against Allah, the Glorified One, while the right \nof the child on the father is that the latter should give the first a beautiful \nname, provide him with good training and teach him the Quran.. \n \n \n410. Imam Ali ibn Abu Talib (x) said: Evil effect of sight is right, \ncharm is right, sorcery is right, and fa’l (auguring good) is right, while \ntayrah (auguring evil)282 is not right, and spreading of a disease from one \nto the other is not right. Scent gives pleasure, honey gives pleasure, riding \ngives pleasure and looking at greenery gives pleasure. \n \n \nAuguring well is not objectionable. For example, when after the \nmigration of the Prophet (from Mecca to Medina), Quraysh announced \n \n282“Fa’l” means something from which one augurs well while “tayrah” \nmeans something from which one augurs evil. From the point of view of religious \nlaws, auguring evil from anything has no basis and it is just the product of whims. \nthat whoever apprehended the Prophet would be given one hundred \ncamels as a reward. Thereupon, Buraydah ibn al-Husayb al-Aslami set off \nin his search with seventy of his men. When they met at a halting place, \nthe Prophet asked him who he was. He said he was Buraydah ibn al-\nHusayb al-Aslami. Buraydah said, “The Holy Prophet was not auguring \nevil. Instead, he used to augur good.” On hearing this, the Prophet \nremarked: “Barada amruna wa saluha” (our affair will be cooled and \nsound). Then he asked him what tribe he came from. When he replied that \nhe was from Aslam, the Prophet remarked: “Salimna!” (We are safe). \nThen he asked from which scion he was. When Buraydah replied that he \nwas from Banu Sahm, the Prophet remarked: “Kharaja sahmuka” (your \narrow has missed its aim). Buraydah was much impressed by this pleasing \nconversation and inquired from the Prophet who he was. The Prophet \nreplied, “Muhammad ibn Abdullah”. Hearing this, he spontaneously \nexclaimed, “I do stand witness that you are the Messenger of Allah!” \nForsaking the prize announced by the Quraysh, he instead acquired the \nwealth of belief” (Al-Isti`ab, Vol. 1, pp. 185-186, Usd al-Ghabah, Vol. 1, \npp. 175-176). \n \n \n411. Imam Ali ibn Abu Talib (x) said: Nearness with people in \ntheir manners brings about safety from their evil. \n \n \n412. Someone uttered an expression above his status. Imam Ali \nibn Abu Talib (x) said: You have started flying soon after growing \nfeathers and commenced grumbling before attaining youth. \n \n \nSayyid ar-Radi says: Here, “shakir” [in the original Arabic text] \nmeans the first feathers that grow on a bird before it is strong enough to \nfly. And “saqb” means the young camel who does not grumble unless it \nbecomes mature. \n \n \n413. Imam Ali ibn Abu Talib (x) said: Whoever hankers after \ncontraries gets no means of success. \n \n \n414. On being asked about the meaning of the expression: “la \nhawla wala quwwata illa billah” (there is no strength nor power except \nthrough Allah), Imam Ali ibn Abu Talib (x) said: We are not masters of \nanything along with Allah, and we are not masters of anything save what \nHe makes us masters of. So, when He makes us masters of anything of \nwhich He is a superior Lord over us, He also assigns some duties to us. \nAnd when He takes it away, He takes away those duties as well.\n415. Imam Ali ibn Abu Talib (x) heard ‘Ammar ibn Yasir (may \nAllah have mercy on him) conversing with al-Mughirah ibn Shu‘bah and \nsaid: Leave him alone, O ‘Ammar, for he has entered religion only to the \nextent of his deriving advantage of the world, and he has willfully \ninvolved himself in misgivings in order to adopt them as cover for his \nshortcomings. \n \n \n416. Imam Ali ibn Abu Talib (x) said: It is good for the rich to \nshow humility before the poor to seek rewards from Allah, but better than \nthat is the pride of the poor towards the rich with trust in Allah. \n \n \n417. Imam Ali ibn Abu Talib (x) said: Allah does not grant \nwisdom to a person except that some day He will save him from ruin with \nits help. \n \n \n418. Imam Ali ibn Abu Talib (x) said: Whoever clashes with the \ntruth will be knocked down by it. \n \n \n419. Imam Ali ibn Abu Talib (x) said: The heart is the book of \nthe eye. \n \n \n420. Imam Ali ibn Abu Talib (x) said: Fear of Allah is the chief \ntrait of the human character. \n \n283What Imam Ali ibn Abu Talib (x) meant is that man does not enjoy \nregular mastery over anything. Rather, such mastery is assigned by Allah. So \nlong as this mastery lasts, the obligations of the Shari`a also continue, whereas \nwhen the mastery is taken away, the obligations, too, are lifted off, since in such \na case, the laying of obligations will mean placing the responsibility beyond \ncapacity which cannot be permitted by any wise or prudent person. This is why \nAllah has placed the responsibility of performing various acts after having \nconferred the necessary energy in the limbs. It follows that this responsibility \nwill remain only so long as the energy subsists and that on the disappearance of \nthe energy, the responsibility for action will also disappear. For example, the \nobligation to pay zakat applies only when there is wealth, but when Allah takes \naway the wealth, He removes the liability to pay zakat because in such a case, \nthe laying of obligation is against prudence.\n421. Imam Ali ibn Abu Talib (x) said: Do not try the sharpness of \nyour tongue against the One Who gave you the power to speak, nor the \neloquence of your speech against the One Who set you on the right path. \n \n \n422. Imam Ali ibn Abu Talib (x) said: It is enough for your own \ndiscipline that you abstain from what you dislike from others. \n \n \n423. Imam Ali ibn Abu Talib (x) said: One should endure like \nfree people; otherwise, one should keep quite like the ignorant. \n \n \nIn an incident, it is related that Imam Ali ibn Abu Talib (x) said \nto al-Ash‘ath ibn Qays by way of offering his condolences on the death of \nhis son: Either endure like great people or else you will forget like \nanimals. \n \n \n424. Imam Ali ibn Abu Talib (x) said: It deceives, it harms and it \npasses away. Allah, the Sublime, did not approve it as a reward for His \nlovers nor as a punishment for His enemies. In fact, the people of this \nworld are like those riders that as soon as they descended, the driver \ncalled out to them and they marched off. \n \n \n425. Imam Ali ibn Abu Talib (x) said to his son al-Hassan (x): O \nmy son! Do not leave anything of this world behind you because you will \nbe leaving it for either of two sorts of persons: a person who uses it in \nobeying Allah, in this case he will acquire virtue through what was evil \nfor you, or a person who uses it in disobeying Allah and, in that case, he \nwill be reaping evil with what you collected for him. So, you will be \nassisting him in his sinfulness. Neither of these two deserves to be \npreferred by you over your own self. \n \n \nSayyid ar-Radi says: “This saying is also related in another \nversion thus: Whatever of this world is now with you was with others \nbefore you, and it will pass to some others after you. Thus, you are \ncollecting things for either of two sorts of men: a man who uses whatever \nyou collected in obedience of Allah and thus acquired virtues with what \nwas evil for you, or a man who uses it in disobeying Allah, so you will be \ngetting evil for what you collected. Neither of these two is such that you \nshould prefer him over your own self, for you may burden yourself for his \nown sake. Therefore, hope for the mercy of Allah: Divine livelihood for \nwhoever survives anyone who passes away. \n426. Someone said “Astaghfirullah!” (I seek Allah’s forgiveness) \nbefore Imam Ali ibn Abu Talib (x). Imam Ali ibn Abu Talib (x) said: \nMay your mother may lose you! Do you know what “istighfar” is? \n“Istighfar” is meant for people of a high status. It is a word that stands on \nsix pillars: The first is to repent over the past, the second is to make a firm \ndetermination never to revert to it, the third is to carry out all the rights of \npeople so that you may meet Allah quite clean with nothing to account \nfor, the fourth is to fulfil every obligation which you ignored (in the past) \nso that you may now do justice with it, the fifth is to aim at the flesh \ngrown as a result of unlawful earning, so that you may melt it by grief (of \nrepentance) till the skin touches the bone and a new flesh grows between \nthem, and the sixth is to make the body taste the pain of obedience as you \n(previously) made it taste the sweetness of disobedience. It is only on \nsuch an occasion that you may say: “Astaghfirullah!”\n \n \n427. Imam Ali ibn Abu Talib (x) said: Clemency is (like) \nkinsfolk.\n \n \n428. Imam Ali ibn Abu Talib (x) said: How wretched the son of \nAdam is! His death is hidden, his ailments are concealed, his actions are \npreserved, the bite of a mosquito pains him, choking cause his death and \nsweat gives him a bad smell. \n \n \n429. It is related that Imam Ali ibn Abu Talib (x) was sitting with \nhis companions when a beautiful woman passed by and they began to \nlook at her. It was then that Imam Ali ibn Abu Talib (x) said: The eyes of \nthese men are covetous, and such glances are the cause of their becoming \ncovetous. Whenever anyone of you sees a woman who attracts him, he \nshould meet his wife [for cohabitation] because she is a woman just like \nhis wife. \n \n \nOne of the Kharijites said: “May Allah kill this heretic! How \nlogical he is!” People then leapt towards him to kill him, but Imam Ali \nibn Abu Talib (x) said: “Wait a little bit. There should either be abuse [for \nan abuse] or else pardoning from the offence.” \n \n \n430. Imam Ali ibn Abu Talib (x) said: Suffices you if your \nwisdom distinguishes for you the ways of going astray from those of \nguidance.\n431. Imam Ali ibn Abu Talib (x) said: Do good and do not regard \nany part of it small because its small is big and its little is much. None of \nyou should say that “Another person is more deserving than me” in doing \ngood. Otherwise, by Allah, it will really be so. There are people of good \nand evil. When you leave either of the two, others will perform it. \n \n \n432. Imam Ali ibn Abu Talib (x) said: Whoever mends his \ninward self, Allah mends his outward self. Whoever performs acts for the \nsake of his religion, Allah accomplishes his acts of this world. Anyone \nwhose dealings between himself and Allah are good, Allah turns the \ndealings between him and other people good, too. \n \n \n433. Imam Ali ibn Abu Talib (x) said: Forbearance is a covering \ncurtain, and wisdom is a sharp sword. Therefore, conceal the weaknesses \nin your conduct with forbearance and kill your desires with your wisdom. \n \n \n434. Imam Ali ibn Abu Talib (x) said: There are some creatures \nof Allah whom Allah particularly chooses for His favors so that they may \nbe of benefit to other people. Therefore, He keeps such favors in their \nhands so long as they give them out to others. But when they deny them \nto others, He takes away the favors from them and gives them to others. \n \n \n435. Imam Ali ibn Abu Talib (x) said: It does not behoove a man \nto have trust in two things: health and riches, because there is many a man \nwhom you see healthy but he soon falls and many a man whom you see \nrich but soon turns destitute. \n \n \n436. Imam Ali ibn Abu Talib (x) said: Whoever complains about \na need to a believer, it is as though he has complained about it to Allah. \nBut whoever complains about it to an unbeliever, it is as though he \ncomplained about Allah. \n \n \n437. Imam Ali ibn Abu Talib (x) said on the occasion of an ‘Id: It \nis an ‘Id for anyone whose fast is accepted by Allah and for whose \nprayers He is grateful, and (in fact) every day wherein no sin against \nAllah is committed is an ‘Id.284\n \n284If vision and conscience are alive, even the remembrance of a sin destroys \none’s peace of mind because tranquility and happiness are achieved only when \nthe spirit is free from the burden of sin and one’s robe is not polluted with \ndisobedience. And this real happiness is not bound by time, but on whenever \none desires, he can avoid sin and enjoy this happiness. Such happiness will be \n438. Imam Ali ibn Abu Talib (x) said: On the Day of Judgement, \nthe greatest regret will be felt by the man who earned wealth through \nsinful ways, although it is inherited by a person who spends it in obeying \nAllah, the Glorified One, and he will be awarded Paradise on that account \nwhile the first one will be dragged into the Fire on its account. \n \n \n439. Imam Ali ibn Abu Talib (x) said: The worst in bargaining \nand the most unsuccessful in striving is a man who exerts himself in \nseeking riches although fate does not help him in his aims and, \nconsequently, he goes from this world in a sorrowful state while in the \nnext world, too, he will face its ill consequences.285\n \n \n440. Imam Ali ibn Abu Talib (x) said: Livelihood is of two kinds: \nthe seeker and the sought. Therefore, whoever hankers after this world, \ndeath traces him till it turns him out of it. But whoever hankers after the \nnext world, worldly ease itself seeks him till he receives his livelihood \nfrom it. \n \n \n441. Imam Ali ibn Abu Talib (x) said: The lovers of Allah are \nthose who look at the inward side of the world, while the other people \nlook at its outward side. They occupy themselves with its most remote \nbenefits while the other people occupy themselves with the immediate \nbenefits. They kill those things which they feared will have killed them, \nand they leave here in this world what they think will leave them. They \ntook the amassing of wealth by others as a small matter and regarded it \nlike losing. They are enemies of those things which others love while they \nlove things which others hate. Through them, the Quran has been learned, \nand they have been given knowledge through the Quran. With them, the \nQuran is staying while they stand by the Quran. They do not see any \n \nthe real happiness, and the harbinger of an ‘Id. A Persian poet says: “Every night \nis the Grand Night provided you appreciate its value.” \n285Despite efforts throughout life, a man does not always achieve all the \nsuccesses of life. If on some occasions he succeeds, as a result of effort and \nseeking, on many others he has to face defeat and to give up his objectives, \nadmitting defeat before fate. A little thinking can lead to the conclusion that \nwhen things of this world cannot be achieved despite one’s effort and pursuit, \nhow can the success of the next world be achieved without striving and \npursuing? A Persian couplet says: “You hankered after the world but did not \nattain the objective. O Allah! What will be the result when the good of the next \nworld has not even been sought?” \nobjective of hope above what they hope and no objective of fear above \nwhat they fear. \n \n \n442. Imam Ali ibn Abu Talib (x) said: Remember that pleasures \nwill pass away while the consequences will stay. \n \n \n443. Imam Ali ibn Abu Talib (x) said: Try (a man) and you will \nhate him! \n \n \nSayyid ar-Radi says: “Some people say that this saying was \narticulated by the Prophet (h), but what confirms that it is the saying of \nImam Ali ibn Abu Talib (x) is the statement related by Tha‘lab from Ibn \nal-Arabi, that is, that (caliph) al-Ma’mun said, “If Ali had not said \n‘ukhbur thiqlihi’ (try a man and you will hate him),” I will have said: \n‘aqlihi takhbur’ (hate a man in order to try him).” \n \n \n444. Imam Ali ibn Abu Talib (x) said: It is not that Allah, to \nWhom belongs Might and Majesty, may keep the door of gratitude open \nfor a person and close the door of plenty upon him, or to open the door of \nprayer to a person and close the door of acceptance upon him, or to open \nthe door of repentance on a person and close the door of forgiveness upon \nhim. \n \n \n445. Imam Ali ibn Abu Talib (x) said: The most appropriate \nperson for an honorable status is whoever descends from the people of \nhonor.\n \n \n446. Imam Ali ibn Abu Talib (x) was asked: “Which of the two is \nbetter: justice or generosity?” Imam Ali ibn Abu Talib (x) replied: \n“Justice puts things in their places while generosity takes them out from \ntheir directions. Justice is the general caretaker, while generosity is a \nparticular benefit. Consequently, justice is superior and more \ndistinguished of the two.” \n \n \n447. Imam Ali ibn Abu Talib (x) said: People are enemies of \nwhat they do not know. \n \n \n448. Imam Ali ibn Abu Talib (x) said: The whole of asceticism is \nconfined between two expressions of the Quran: Allah, the Glorified One, \nsays: “... lest you should distress yourselves because of what you miss and \nbe over-joyous for what He has granted you” (Quran, 57: 23). Whoever \ndoes not grieve over what he misses and does not revel over what comes \nto him acquires asceticism from both its sides. \n \n \n449. Imam Ali ibn Abu Talib (x) said: What a breaker is sleep for \nthe resolutions of the day! \n \n \n450. Imam Ali ibn Abu Talib (x) said: Governing power is the \nproving ground for people. \n \n \n451. Imam Ali ibn Abu Talib (x) said: No town has a greater \nright on you than the other. The best town for you is that which bears you. \n \n \n452. When the news of the death of (Malik) al-Ashtar (may Allah \nhave mercy on him), reached Imam Ali ibn Abu Talib (x), he said: Malik, \nwhat a man Malik was! By Allah! If he had been a mountain, he would \nhave been a big one (a find), and if he had been a stone, he would have \nbeen quite stiff. No horseman could have reached it and no bird could \nhave flown over it. \n \n \nSayyid ar-Radi says: “find” means a lonely mountain (rising in \nheight above the others in the range). \n \n \n453. Imam Ali ibn Abu Talib (x) said: A little that lasts is better \nthan much that brings grief. \n \n \n454. Imam Ali ibn Abu Talib (x) said: If a man possesses a \nrevealing quality, wait and see his other qualities.286\n \n \n455. Imam Ali ibn Abu Talib (x) asked Ghalib ibn Sa‘sa‘ah, \nfather of al-Farazdaq (the famous Arab poet), during a conversation \nbetween them: “What about the large number of your camels?!” The man \nreplied: “They have been swept away by (the performing of) obligations, \n \n286The good or bad quality that is found in a man springs from his \nnatural temperament. If the temperament produces one quality, his other \nqualities will also be akin to this one because the dictates of temperament will be \nequally effective in either. Thus, if a man pays zakat and khums, it means that \nhis temperament is not miserly. Therefore, it is expected that he will not be \nniggardly in spending in other items of charity as well. Similarly, if a man \nspeaks a lie, it can be expected that he will indulge in backbiting, too, because \nthese two habits are similar to each other. \nO Imam Ali ibn Abu Talib (x)!” Whereupon Imam Ali ibn Abu Talib (x)\nsaid: “That is the most praiseworthy way of (losing) them.” \n \n \n456. Imam Ali ibn Abu Talib (x) said: Whoever trades without \nknowing the rules of religious law will be involved in usury. \n \n \n457. Imam Ali ibn Abu Talib (x) said: Whoever regards small \ndistresses as big, Allah involves him in big ones. \n \n \n458. Imam Ali ibn Abu Talib (x) said: Whoever maintains his \nown respect in view, his desires appear light to him. \n \n \n459. Imam Ali ibn Abu Talib (x) said: Whenever a man cuts a \njoke, he separates himself away a bit from his wit. \n \n \n460. Imam Ali ibn Abu Talib (x) said: Your turning away from \nthe one who inclines towards you is a loss of your share of advantage, \nwhile your inclining towards one who turns away from you is self-\nhumiliation. \n \n \n461. Imam Ali ibn Abu Talib (x) said: Riches and destitution will \nfollow presentation before Allah. \n \n \n462. Imam Ali ibn Abu Talib (x) said: Al-Zubayr remained a man \nfrom our house till his wretched son ‘Abdullah came forth. \n \n \nAbdullah ibn az-Zubayr ibn al-Awwam (1/662-73/692), whose \nmother was Asma’, sister of Aisha (daughter of Abu Bakr), had grown in \nhis dislike of Banu Hashim especially towards Imam Ali ibn Abu Talib \n(x) to such an extent that he was able to change the opinion of his father, \naz-Zubayr, against Imam Ali ibn Abu Talib (x) although the latter was the \nson of his father’s aunt. That is why Imam Ali ibn Abu Talib (x) said: \n“Az-Zubayr had always been from us, Ahl al-Bayt (x) (our household), \ntill his ill-owned son ‘Abdullah grew up. (Al-Isti`ab, Vol. 3, p. 906, Usd \nal-Ghabah, Vol. 3, pp. 162-163, Ibn Asakir, Vol. 7, p. 363, Ibn Abul-\nHadid, Vol. 2, p. 167, Vol. 4, p. 79, Vol. 20, p. 104). \n \n \nAbdullah was one of the instigators of the battle of Jamal. His \naunt, Aisha, his father, az-Zubayr, and the son of his mother’s uncle, \nTalhah, all fought against Imam Ali ibn Abu Talib (x). \nThus, Ibn Abul-Hadid writes the following: “It was ‘Abdullah \nwho urged az-Zubayr to fight (in the battle of Jamal), and made the march \nto Basra seem attractive to Aisha” (Sharh Nahjul-Balagha, Vol. 4, p. 79). \n \n \nAisha loved her nephew Abdullah very much. To her, he was like \nthe only child of a mother, and none in those days was more beloved to \nher than he was” (Al-Aghani, Abul-Faraj al-Isbahani, Vol. 9, p. 142, Ibn \nAbul-Hadid, Vol. 20, p. 120, Ibn Kathir, Vol. 8, p. 336). \n \n \nHisham ibn ‘Urwah relates the following: “I have not heard her \n(Aisha) praying for anyone as much as she used to pray for him \n(Abdullah). She gave ten thousand dirhams (as a gift) to the one who \ninformed her of Abdullah’s safety from getting killed (by al-Ashtar in the \nfight of the Battle of Jamal), and prostrated to Allah in thanks-giving for \nhis safety” (Ibn Asakir, Vol. 7, pp. 400, 402, Ibn Abul-Hadid, Vol. 20, p. \n1117).\n \n \nThis was the reason for Abdullah’s authority over her and his \ncomplete command over her affairs. He was the one who directed and \nguided her in the direction which he wished. \n \n \nHowever, Abdullah’s hatred towards Banu Hashim had reached \nsuch a stage that according to the narrations of a group of historians, “ \nDuring his (Abdullah’s) caliphate (in Mecca), he did not send blessings \non the Holy Prophet in his Friday prayer sermon (khutba) for forty \nFridays. He used to say: ‘Nothing prevents me from mentioning the \nProphet’s name except that there are certain men (i.e. Banu Hashim) who \nbecome proud (when his name is mentioned).’” In another rendering, the \ntext reads as follows: “Nothing prevents ... except that the Prophet has a \nbad household who will shake their heads on the mention of his name” \n(Maqatil at-Talibiyyin, p. 474, Muruj ath-Dhahab, Vol. 3, p. 79, At-\nTarkh, al-Ya‘qubi, Vol. 2, p. 261, Al-‘Iqd al-Farid, Vol. 4, p. 413, Ibn \nAbul-Hadid, Vol. 4, p. 62, Vol. 19, pp. 91-92, Vol. 20, pp. 127-129). \n \n \nAbdullah ibn az-Zubayr said to Abdullah ibn ‘Abbas once: “I \nhave been concealing my hatred towards you, the people of this house \n(i.e. the Household of the Prophet [k]) for the last forty years...” (al-\nMas‘udi, Vol. 3, p. 80, Ibn Abul-Hadid, Vol. 4, p. 62, Vol. 20, p. 148). \nHe also used to hate Imam Ali ibn Abu Talib (x) in particular, \ndefame his honor, abuse and curse him (al-Ya‘qubi, Vol. 2, pp. 261-262, \nal-Mas‘udi, Vol. 3, p. 80, Ibn Abul-Hadid, Vol. 4, pp. 61, 62-63, 79). \n \n \nHe gathered Muhammad ibn al-Hanafiyyah (son of Imam Ali ibn \nAbu Talib [x]) and Abdullah ibn ‘Abbas with seventeen men from Banu \nHashim, including al-Hassan ibn al-Hassan ibn Ali ibn Abu Talib [al-\nHassan II] and imprisoned them in the shi‘b (valley) of ‘Arim. He \nintended to burn them alive, so he placed plenty of wood at the entrance \nof the shi‘b. Meanwhile, al-Mukhtar ath-Thaqafi dispatched four thousand \nsoldiers to Mecca. On their arrival, they attacked ‘Abdullah ibn az-Zubayr \nunexpectedly and rescued Banu Hashim. ‘Urwah ibn az-Zubayr made an \nexcuse for his brother’s (Abdullah) deed saying that this action of his \nbrother’s was a result of Banu Hashim’s refusal to swear the oath of \nallegiance to him (Abdullah), like the action of `Umar ibn al-Khattab \ntowards Banu Hashim when they gathered in the house of Fatimah and \nrefused to swear the oath of allegiance to Abu Bakr. So, Umar brought \nwood and intended to burn the house on them. (Maqatil at-Talibiyyin, p. \n474, al-Mas‘udi, Vol. 3, pp. 76-77, al-Yaqubi, Vol. 2, p. 261, Ibn Abul-\nHadid, Vol. 19, p. 91, Vol. 20, pp. 123-126, 146-148, Ibn ‘Asakir, Vol. 7, \np. 408, al-‘Iqd al-farid, Vol. 4, p. 413, Ibn Sa‘d, Vol. 5, pp. 73-81, at-\nTabari, Vol. 2, pp. 693-695, Ibn al-Athir, Vol. 4, pp. 249-254, Ibn \nKhaldÅn, Vol. 3, pp. 26-28). \n \n \nIn this regard, Abul-Faraj al-Isfahani writes the following: \n“Abdullah ibn az-Zubayr always instigated others against Banu Hashim \nand persuaded them (to adopt his viewpoint) by every worst method. He \nspoke against Banu Hashim from the pulpit, remonstrating against them. \nOnce, Ibn ‘Abbas, or someone else from (Banu Hashim) raised an \nobjection against him. But afterwards, he changed his way and \nimprisoned Ibn al-Hanafiyyah at the shi‘b ‘Arim. Then he gathered Ibn al-\nHanafiyyah along with other members of Banu Hashim who were present \n(in Mecca) in a prison and collected wood to set fire to it. This was so \nbecause of the news that had reached him that Abu ‘Abdullah al-Jadali \nand other followers of Ibn al-Hanafiyyah had arrived (in Mecca) to \nsupport Ibn al-Hanafiyyah against fight ‘Abdullah ibn az-Zubayr. \nTherefore, he hastened to do away with the prisoners. But when this news \nreached Abu ‘Abdullah al-Jadali, the latter went when the fire was already \nset on them, putting the fire out and rescuing them (Al-Aghani, p. 15). \n \n \nSo, all these prove what Imam Ali ibn Abu Talib (x) said about \nhim. \n463. Imam Ali ibn Abu Talib (x) said: What has a man to do with \nvanity? His origin is semen, his end is a carcass, while he cannot feed \nhimself nor ward off death?\n464. Imam Ali ibn Abu Talib (x) was asked who the greatest poet \nwas. He said: “Any group of them that did not proceed on the same lines \nin such a way that we can know the height of their glory, but if it has to be \ndone, then it is ‘al-Malik ad-Dillil’”.288\n \n \nSayyid ar-Radi says, “Amir al-Mu’minin here is referring to \nImri’ul-Qays. \n \n287If one ponders over his original condition, the eventual breaking up \nand ruining of his body, he will be compelled to admit his lowliness and humble \nstatus instead of being proud and vain. He will see that there was a time when he \ndid not exist, then Allah originated his existence with a humble drop of semen \nwhich took the shape of a piece of flesh in the mother’s womb and continued \nfeeding and growing on thick blood. Upon completion of the body, he set foot \non earth. He was then so helpless and incapable that he had neither control over \nhis hunger and thirst nor on his sickness and health, nor could he do himself any \nbenefit or harm. He had no authority over life and death, not knowing when the \nenergy of limbs might be exhausted. He felt his senses might stop functioning, \nhis eyesight might be taken away, his ability to hear might be snatched away. He \ncould not tell when death might separate the spirit from the body and leave the \nlatter to be cut into pieces by vultures and kites or for worms to eat in the grave. \nAn Arabic couplet says: “How does one whose origin is semen and whose end is \na carcass dare be vain?” \n288This means that a comparison can be made among the poets when \ntheir imagination runs in the same field. But when the expression of one differs \nfrom that of another, and when the style of one varies from that of another, it is \ndifficult to decide who is defeated and who has wins the prize. Consequently, \nfrom various considerations, one is preferred over the other, and someone is \nconsidered greater for one consideration, while the other wins the other \nconsideration, as the famous saying goes: “The greatest poet of Arabia is \nImri’ul-Qays when he rides, al-A‘sha when he is eager for something, and an-\nNabighah [the genius] when he is terrified.” Nevertheless, despite this \ncategorization, Imri’ul-Qays is held in high esteem among the poets of the first \nera because of the beauty of his imagery, the excellence of his description, his \ninimitable similes and rare metaphors, although many of his couplets are below \nmoral standards and speak of obscene subjects. But in spite of this obscenity, the \ngreatness of his art cannot be denied. An artist looks at a poetic production from \nthe point of view of art, ignoring the other elements which do not affect art. \n465. Imam Ali ibn Abu Talib (x) said: Is there no free man who \ncan leave this chewed morsel (of the world) to those who like it? \nCertainly, the only price for your souls is Paradise. Therefore, do not sell \nyour soul except for Paradise. \n \n \n466. Imam Ali ibn Abu Talib (x) said: Two greedy persons never \nget satisfied: the seeker of knowledge and the seeker of this world. \n \n \n467. Imam Ali ibn Abu Talib (x) said: Belief means that you \nshould prefer truth (even) when it harms you rather than falsehood (even) \nwhen it benefits you, that your words should not be more than your action \nand that you should fear Allah when speaking about others. \n \n \n468. Imam Ali ibn Abu Talib (x) said: Destiny holds sway over \n(our) predetermination till effort itself brings about ruin. \n \n \nSayyid ar-Radi says, “Something of this meaning has already \nappeared earlier though in words different from these.” \n \n \n469. Imam Ali ibn Abu Talib (x) said: Forbearance and \nendurance are twins and they are the product of high courage. \n \n \n470. Imam Ali ibn Abu Talib (x) said: Backbiting is the tool of \nthe helpless. \n \n \n471. Imam Ali ibn Abu Talib (x) said: Many a man gets into \nmischief because of being spoken well of. \n \n \n472. Imam Ali ibn Abu Talib (x) said: This world has been \ncreated for other than itself and has not been created for itself. \n \n \n473. Imam Ali ibn Abu Talib (x) said: Banu Umayyah (the \nUmayyads) have a fixed period (mirwad) wherein they are having their \nway. But when differences arise among them, even if the hyena attacks \nthem, it will overpower them. \n \n \nSayyid ar-Radi says, “Here, mirward is a form derived from \nirwad which means: to allow time, to wait for, to give a respite. It is an \nextremely eloquent and wonderful expression. It is as though Imam Ali \nibn Abu Talib (x) has likened the period of BanÅ Umayyah to a limited \narea meant for the training of horses for racing where they are running \ntowards the limit, so that when they reach its extremity, their organization \nis destroyed.289 474. Eulogizing the Ansar, Imam Ali ibn Abu Talib (x)\nsaid: By Allah, they nurtured Islam with their generous hands and \neloquent tongues as a year-old calf is nurtured. \n \n \n475. Imam Ali ibn Abu Talib (x) said: The eye is the strap of the \nrear.\n \n \nSayyid ar-Radi says, “This is a wonderful metaphor. It is as \nthough Imam Ali ibn Abu Talib (x) has likened the rear part of the body \nto a bag and the eye to a strap. When the strap is let loose, the bag cannot \nretain anything. According to the well-known and reputed view, this is a \nsaying of the Prophet, but some people have stated it belong to Imam Ali \nibn Abu Talib (x). Al-Mubarrad has mentioned it in his book Al-\nMuqtadab under a chapter titled “Words of single letters”. We, too, have \ndiscussed this metaphor in our book titled Majazat al-Athar an-\nNabawiyyah.” \n \n289This is a prediction about the decline and fall of the Umayyads that \nproved true, word for word. This rule was founded by Mu`awiyah ibn Abu \nSufyan and ended with Marwan ibn Muhammad al-Himar in 132 A.H. (749 \nA.D.) after a life of ninety years, eleven months and thirteen days. The \nUmayyad period was second to none in tyranny, oppression, cruelty and \ndespotism. The despotic rulers of this period perpetrated such tyranny that it put \nblots on Islam, blackened the pages of history and injured the spirit of humanity. \nThey allowed every kind of ruin and destruction only to retain their own \nauthority. They led armies into Mecca, hurled fire on the Ka‘ba, made Medina \nthe victim of their brute passions and shed streams of Muslim blood. At last, this \nbloodshed and ruthlessness resulted in rebellions and conspiracies from all sides \nagainst the Umayyads. The latter’s own their internal strife and agitation as well \nas mutual fighting paved the way for their ruin. Although political unrest had set \nin among them earlier, during the days of al-Wald ibn Yazid, open disturbances \nbegan to take place. On the other hand, Banu al-Abbas (the ‘Abbasids) also \nstarted preparations [to take over power from the Umayyads]. During the reign \nof Marwan al-Himar, they started a movement under the name of “al-Khilafah \nal-Ilahiyyah” (the Divine Caliphate). For successful piloting of this movement, \nthey got a martial leader, namely Abu Muslim al-Khurasani who, in addition to \nhis knowledge of political events and occurrences, was also an expert in the art \nof warfare. Making Khurasan his base, he spread a whole net against the \nUmayyads and succeeded in bringing the Abbasids to power. In the beginning, \nthis man was quite unknown, and it is for this reason and for his humble status \nthat Imam Ali ibn Abu Talib (x) likened him and his associates to the hyena as \nthis simile is used for modest and humble people. \n476. Imam Ali ibn Abu Talib (x) said in one of his speeches: A \nruler came to power over them. He remained upright and made them \nupright till the entire religion put its bosom on the ground. \n \n \n477. Imam Ali ibn Abu Talib (x) said: A severe time will come to \npeople wherein the rich will seize their possessions with their teeth (by \nway of miserliness) although they have not been commanded to do so. \nAllah, the Glorified One, says: “Do not forget generosity among \nyourselves” (Quran, 2: 237). During this time, the wicked will rise up \nwhile the virtuous will remain low. Purchases will be made from the \nhelpless, although the Prophet (k) has prohibited purchasing from the \nhelpless.290\n \n \n478. Imam Ali ibn Abu Talib (x) said: Two types of persons will \nfall into ruin on my account: One who loves me and exaggerates, and the \nother who lays on me false and baseless blames. \n \n \nSayyid ar-Radi says, “ This is on the lines of Imam Ali ibn Abu \nTalib (x) own saying which runs thus: ‘Two categories of persons will be \nruined on my account: One who loves me with exaggeration, and one who \nhates [me] and is a bearer of malice’.” The Holy Prophet (k) used often \nto urge and order the ummah to love Imam Ali ibn Abu Talib (x),\nforbidding them from bearing any hatred against him. Moreover, the Holy \nProphet (k) used to regard the love for Imam Ali ibn Abu Talib (x) as \nthe sign of Faith (iman) and hating him as the sign of hypocrisy (nifaq) \n(as we have already mentioned in a footnote above). \n \n \n We would like to quote one of the traditions of the Holy Prophet \n(k) with regard to this subject. It has been narrated through fourteen \ncompanions that the Holy Prophet (k) said, “Whoever loves Ali, he \nsurely loves me, and whoever loves me, he surely loves Allah, and \nwhoever loves Allah, He will permit him to enter Paradise. Whoever \nhates Ali, he surely hates me, and whoever hates me, he surely hates \nAllah, and whoever hates Allah, He will surely let him enter the Fire. And \nwhoever harms Ali, he surely harms me, and whoever harms me, he \n \n290Generally, purchases are made from helpless people in such a way \nthat taking advantage of their need and necessity, things are purchased from \nthem at cheap prices and are sold to them at high prices. No religion allows \ntaking advantage of such helplessness and extreme need, nor is it ethically \npermissible to profiteer by taking advantage of others’ helplessness. \nsurely harms Allah, (Surely, those who harm [the Cause of] Allah and His \nMessenger, Allah has cursed them in the present life and in the one to \ncome and has prepared for them a humiliating chastisement [Quran, 33: \n57]) (Al-Mustadrak, Vol. 3, pp. 127-128, 130, Hilyat al-Awliya, Vol. 1, \npp. 66-67, Al-Isti`ab, Vol. 3, p. 1101, Usd al-Ghabah, Vol. 4, p. 383, Al-\nIsabah, Vol. 3, pp. 496-497, Majma‘ az-Zawa’id, Vol. 9, pp. 108-109, \n129, 131, 132, 133, Kanz al-Ummal, Vol. 12, pp. 202, 218-19, Vol. 15, \npp. 95-96, Vol. 17, p. 70, Ar-Riyad an-Nadirah, Vol. 2, pp. 166, 167, 209, \n214, Al-Manaqib, Ibn al-Maghazili, pp. 103, 196, 382). \n \n \nAt the same time, the Holy Prophet used to caution the ummah \nagainst exaggerating with regard to love for Imam Ali ibn Abu Talib (x)\nthat exceeds the bounds of Islam. One who does so is called ghali \n(extremist), In other words, such a person is anyone who believes that the \nHoly Prophet (k) or Imam Ali ibn Abu Talib (x) or any of Shi‘ite Imam \nis a god, or attributes to them the special attributes of Allah, or believes \nthat the twelve Imams are prophets, or makes any claim which they (the \nHoly Prophet and the Imams) did not make about themselves. \n \n \nOn the contrary, the Holy Prophet had also forbidden any offense \nor denigration concerning them (the Imams). He used to blame those who \nlay false and baseless accusations against them as well as those who hated \nand harbored malice against them. \n \n \nIt was for this reason that the Holy Prophet (k) sometimes used \nto refrain from mentioning some of the excellent qualities of Imam Ali \nibn Abu Talib (x) as Jabir ibn ‘Abdullah al-Ansari narrates: “When Imam \nAli ibn Abu Talib (x) approached the Holy Prophet with the news of the \nconquest over Khaybar by himself (by Imam Ali ibn Abu Talib [x]), the \nHoly Prophet (k) said to him: ‘O Ali! Had it not been for some groups of \nmy ummah who may say about you what the Christians say about `Isa son \nof Maryam, I would have said (something) about you so that you will not \npass before any Muslim but that he will seize the dust from the tracks of \nyour feet to seek a blessing from it. But it suffices to say that you hold the \nsame status in relation to me as Harun held in relation to Musa except that \nthere shall, in all certainty, be no prophet after me’” (Majma` az-Zawa’id, \nVol. 9, p. 131, Ibn Abul-Hadid, Vol. 5, p. 4, Vol. 9, p. 168, Vol. 18, p \n282, Manaqib `Ali ibn Abu Talib, Ibn al-Maghazili, pp. 237-239, \nManaqib Ali ibn Abu Talib, al-Khawarizmi, pp. 75-76, 96, 220, Kifayat \nat-Talib fi Manaqib `Ali ibn Abu Talib, al-Ganji, pp. 264-265, Arjah al-\nMatalib, pp. 448, 454, Yanabi`al-Mawaddah, pp. 63-64, 130-131). \nThe Holy Prophet (k) had also informed the Muslim ummah that \nthere will appear two types of deviated groups among the Muslims who \nwill exceed the bounds of Islamic principles with regard to understanding \nImam Ali ibn Abu Talib (x) as he himself has related: “The Messenger of \nAllah (k) called upon me and said: ‘O Ali! There is a resemblance \nbetween you and `Isa son of Maryam whom the Jews hated so much that \nthey laid a false accusation against his mother, and whom the Christians \nloved so much that they assigned to him the status which is not his’”. \n \n \n(Then, Imam Ali ibn Abu Talib (x) continues to say:) Beware! \nTwo types of persons will fall into ruin on my account: One who loves \n(me) and praise me for what is not in me, and one who hates me and \nwhose detesting me will lead him to any false and baseless accusation on \nme. Beware! I am not a prophet, and nothing has been revealed to me. But \nI act according to the Book of Allah and the Sunnah of His Prophet as \nmuch as I can (Al-Musnad, Ahmad ibn Hanbal, Vol. 1, p. 160, Al-\nMustadrak, al-Hakim, Vol. 3, p. 123, Mishkat al-Masabih, Vol. 3, pp. \n245-246, Majma’ az-Zawa’id, Vol. 9, p. 133, Kanz al-`Ummal, Vol. 12, \np. 219, Vol. 15, p. 110, Ibn Kathir, Vol. 7, p. 356). \n \n \nThe above mentioned sayings of Imam Ali ibn Abu Talib (x) as \nwell have been reported from the Holy Prophet (k) when he said to \nImam Ali ibn Abu Talib (x): “O Ali! Two types of people will fall into \nruin on your account: One who loves you with exaggeration, and the liar \nwho lays false accusation on you” (Al-Isti`ab, vol.3, p. 1101). \n \n \nAlso, he said to him, “Two categories will be ruined on your \naccount: One who loves with exaggeration, and one who hates you and \nwho bears malice [against you]” (Ibn Abil-Hadid, Vol. 5, p. 6). \n \n \nThe famous scholar of tradition, Amir ibn Sharahil ash-Sha‘bi \n(19/640-103/721), has confirmed this saying that these two categories \nappeared and both became disbelievers and were ruined (Al-Isti`ab, Vol. \n3, p. 1130, Al-‘Iqd al-Farid, Vol. 4, p. 312). \n \n \n479. Imam Ali ibn Abu Talib (x) was asked about the Unity of \nAllah (Tawhid) and His justice (Adl). He replied: Unity means that you \ndo not subject Him to the limitations of your imagination, while justice \nmeans that you do not lay any blame on Him.291His words, and He is the \nall-Hearing, the all-Knowing” (Quran, 6: 115). \n \n \n480. Imam Ali ibn Abu Talib (x) said: There is no good in silence \nabout matters involving wisdom just as there is no good in speaking with \nignorance.\n \n \n481. Imam Ali ibn Abu Talib (x) said the following in his prayer \nfor rain: “O Lord! Send us rain by submissive clouds, not by unruly \nones.”\n \n \nSayyid ar-Radi says, “This is an expression of wonderful \neloquence, because Imam Ali ibn Abu Talib (x) has likened the cloud, \nwhich is accompanied by thunder, lightning, wind and flashes with unruly \ncamels that throw away their saddles and throw down their riders, \ndescribing the clouds that are free from these terrible things to the \nsubmissive camels which are easy to milk and obedient to ride.” \n \n \n482. It was said to Imam Ali ibn Abu Talib (x): “We wish you \nhad changed your gray hair, O Imam Ali ibn Abu Talib (x)!” He said: \n“Dye is a way of adornment, whereas we are in a state of grief.” \n \n \nSayyid ar-Radi says, “Imam Ali ibn Abu Talib (x) is referring to \nthe death of the Messenger of Allah (k). \n \n291The belief in the Unity of Allah is not complete unless it is supported \nby belief in Allah being free from all imperfections, that is, one should regard \nHim as being above the limitations of body, shape, place or time and should not \nsubject Him to his own imagination and whims. This is so because the being \nwho is contained by imagination and whims cannot be Allah, but a creation of \nthe human mind can, while the field of mental activity remains confined to \nthings which are seen and observed. Consequently, the greater man will try to \nappreciate Him through illustrations connected by the human mind or through \nhis imaginative efforts, the more remote he will get from reality. In this regard, \nImam Muhammad al-Baqir (x) says, “Whenever you contain Him in your \nimagination, he will not be Allah but a creation like your own self and is \nrevertible to you.” Justice means that whatever the form of injustice and inequity \nis, it should be dissociated from Allah, and He should not be given such \nattributes which are evil, useless and which the mind can in no way agree to \nattribute to Him. In this regard, Allah says, “And perfect is the word of your \nLord in truth and justice: There is none who can change \n483. Imam Ali ibn Abu Talib (x) said: The fighter in the way of \nAllah who gets martyred will not get a greater reward than whoever \nremains chaste despite means. It is possible that a chaste person may \nbecome one of the angels. \n \n \n484. Imam Ali ibn Abu Talib (x) said: Contentment is a wealth \nthat is not exhausted. \n \n \nSayyid ar-Radi says, “Some people have narrated saying that this \nis the statement of the Messenger of Allah (k).”\n \n \n485. When Imam Ali ibn Abu Talib (x) put Ziyad ibn Abih in \nplace of ‘Abdullah ibn al-Abbas over Fars (in Persia) and its revenues, he \nhad a long conversation with him in which he prohibited him from \nadvance recovery of revenue. Therein he said: Act upon justice and stay \naway from violence and injustice because violence will lead them to \nforsake their abodes while injustice will prompt them to take up arms. \n \n \n486. Imam Ali ibn Abu Talib (x) said: The worst sin is that which \nthe one who commits it takes it lightly. \n \n \n487. Imam Ali ibn Abu Talib (x) said: Allah has not made it \nobligatory on the ignorant to learn till He has made it obligatory on the \nlearned to teach. \n \n \n488. Imam Ali ibn Abu Talib (x) said: The worst comrade is he \nfor whom formality has to be observed.292\n \n \nSayyid ar-Radi says, “ This is so because formality is inseparable \nfrom hardship, and it is an evil that is caused by a comrade for whom \nformality is observed. Consequently, he is the worst of all comrades.” \n \n \n489. Imam Ali ibn Abu Talib (x) said: “If a believer enrages \n(ihtashama) his brother, it means that he will leave him.” \n \n292The friendship that is based on love and sincerity makes a man free \nfrom ceremonial formalities, but the friendship for which formalism is necessary \nis unstable. Such a friend is not a true friend. True friendship requires that a \nfriend should not be a cause of trouble for his friend. If he is a cause of trouble, \nhe will prove tedious and harmful and this harmfulness is a sign of his being the \nworst of all friends. \nSayyid ar-Radi says, “It is said that hashamahu or ahshamahu \nmeans: ‘He enraged him’. According to another view, it means ‘He \nhumiliated him’, while ihtashamahu means ‘He sought these for him’, and \nthat is most likely to cause him to separate.” \n \n \nThis is the end of our selection of the utterances of Imam Ali ibn \nAbu Talib (x). We praise Allah, the Glorified One, for having enabled us \nto collect the scattered utterances from various sides and to bring together \nfrom different places the material that was lying far away. We have no \nability save through Allah. In Him we trust, and He is Sufficient for us. \nHe is the best Supporter. \n \n \nThis book was completed in the month of Rajab, in the year 400 \nA.H. (1009 A.D.). \n \n \nMay Allah bless our master Muhammad, the last of the prophets \nand the one who guided us towards the best path, and bless his virtuous \ndescendants and companions who are the stars of conviction. \nPart Eleven\nA Line Reference to some Contents of Nahjul-Balagha \n1. All Praise belongs to Allah Whose Glory lies beyond ... \n(1) al-Harrani, Tuhaf al-Uqul an Al al-Rasul, 57; \n(2) al-Kulayni, Usul al-Kafi, I, 140; \n(3) al-Qada al-Quda‘i, Dustur, 153; \n(4) al-Razi, Tafsrr, II, 164; \n(5) Ibn Talhah, Matalib; \n(6) al-Zamakhshari, Rabi‘ al-Abrar, I, bab al-sama’ wa al-kawakib; \n(7) al-Wasiti, ‘Uyun, see al-Majlisi, Bihar al-Anwar, Vol..77, 300, 423; \n(8) al-Rawandi, Sharh, see Kashif al-Ghita’, Madarik, 69; \n(9) al-Tibrisi, al-’Ihtijaj, I, 150 \n2. I praise Him, seeking the completion of His bounty... \n(1) Ibn Qutaybah, ‘Uyun, I, 326; \n(2) al-Tabari, al-Mustarshid, p. 73;\n(3) Ibn ‘Abd Rabbih, al-‘Iqd, III, 112; \n(4) al-’Amidi, Ghurar, 331, 354; \n(5) Ibn Talhah, Matalib, I. \n3. By Allah, so and so (Ibn Abi Quhafah).... \n(1) Al-Mufid, Al-Jamal, 62;\n(2) Ibn Qubbah, al-’Inqaf, see Ibn Abi al-Hadid, Sharh Nahjul-Balagha, I, \n69; see also ‘Abd al-Zahra’, I, 309-310; \n(3) al-Saduq, Ma‘ani, 344; \n(4) al-Hassan ibn ‘Abd Allah al-‘Askari, from him al-Saduq in Ma‘ani; \n(5) Ibn ‘Abd Rabbih, al-‘Iqd, IV, see ‘Abd al-Zahra’, I, 311-312 and al-\nMajlis, Bihar, Vol..8, 160; \n(6) al-Ka‘bi (d.319/931) - see Ibn Abi al-Hadid, Sharh, I, 69;\n(7) Ibn al-Jawzi, al-Manaqib, see Bihar, Vol..8, 160; and ‘Abd al-Zahra’, \nI, 310-11; \n(8) al-Mufid, al-Irshad, 135; \n(9) al-Qadi ‘Abd al-Jabbar, al-Mughni, see al-Ghadir, VII, 83; \n(10) al-Saduq, Ilal, bab al-illat allati min ajliha taraka Amir al-Mu’minrn \n(x) mujahadat ahl al-khilaf; \n(11) Abu Sa‘id al-’Abi, Nathr al-durar and Nuzhat al-’adib, see Abd al-\nZahra’, I, 313; \n(12) al-Murtada, Al-Shafi, 203, 204; \n(13) al-Saffar, Al-’Inqaf from him al-Tusi in al-‘Amali; \n(14) al-Tusi, al-‘Amali, I, 392; \n(15) Qutb al-Din Rawandi, Sharh, from Ibn Mardawayh and al-Tabrani; \n(16) Sibt ibn al-Jawzi, Tadhkira, 133; \n(17) al-Harrani, Tuhaf, 313; \n(18) al-Murtada, Sharh al-Khutbat al-Shiqshiqiyyah, see A‘yan al-Shi‘ah, \nVol.. 41, p. 195; \n(19) al-Tibrisi, Al-‘Ihtijaj; I, 95; for a detailed discussion of sources, see \n‘Abd al-Zahra’, I, 309-324. \n4. Through us you were guided ... \n(1) Al-Mufid, al-Irshad, 147;\n(2) al-Tabari, al-Mustarshid, 95.\n5. O people, tear the waves of ... \n(1) Sibt ibn al-Jawzi, Tadhkira, bab 6, 137; \n(2) al-Tibrisi, Al-Ihtijaj, I, 127; \n(3) al-Bayhaqi, al-Mahasin, II, 139, see ‘Arshi. \n6. By Allah, I shall not be like the badger that ... \n(1) Al_Tabari, Tarikh, events of the year 36 A.H., VI, 3107; \n(2) Ibn Salam, Gharib Al-Hadrth, 174;\n(3) al_Jawhari, Al-Sihah, V, 2026; \n(4) al-Tusi, Al-Amali, 33. \n7. They have taken Satan to be the sovereign ... \n(1) Al_Zamakhshari, Rabi’, I, 109; \n(2) Ibn al_Athir, Al-Nihaya, II, 50. (kh_t_l ) \n8. He claims that he swore allegiance ... \n(1) Al_Mufid, Al-Jamal, 175, from (2) \n(2) al_Waqidi, Al-Jamal. \n9. They thundered and ... \n(1) Al_Mufid, Al-Jamal, 177, from (2) \n(2) al_Waqidi, Al-Jamal.\n(3) Ibn A‘tham, Futuh, as quoted by (4) \n(4) al_Khwarizmi in Al_Manaqib. \n10. Lo, Satan has brought together ... \n(1) Al_Mufid, Al-Irshad, 118; see also under"
  }
]