[
  {
    "saying_number": 1,
    "saying": "During civil disturbance be like an adolescent camel who has neither a back strong enough for riding nor udders for milking."
  },
  {
    "saying_number": 2,
    "saying": "Whoever adopts greed as a habit devalues himself; whoever discloses his hardship agrees to be humiliated, and whoever allows his tongue to overpower his soul debases the soul."
  },
  {
    "saying_number": 3,
    "saying": "Miserliness is a shame; cowardice is a defect; poverty disables an intelligent man from arguing his case, and a destitute person is a stranger in his own home town."
  },
  {
    "saying_number": 4,
    "saying": "Incapability is a catastrophe; endurance is bravery; abstinence is a wealth; self-restraint is a shield (against sinning), and the best company is submission (to Allah’s will)."
  },
  {
    "saying_number": 5,
    "saying": "Knowledge is a venerable estate; good manners are new outfits, and thinking is a clear mirror."
  },
  {
    "saying_number": 6,
    "saying": "The bosom of the wise is the safe of his secrets; cheerfulness is the bond of friendship; effective forbearance is the grave of shortcomings."
  },
  {
    "saying_number": 7,
    "saying": "Charity is an effective cure, and the actions of people in their present life will be before their eyes in the next."
  },
  {
    "saying_number": 8,
    "saying": "How wonderful is man: He speaks with fat, talks with a piece of flesh, hears with a bone and breathes through a hole!"
  },
  {
    "saying_number": 9,
    "saying": "When this world advances towards anyone (with its riches), it attributes to him the good of others, and when it turns away from him, it deprives him of his own good."
  },
  {
    "saying_number": 10,
    "saying": "Deal with people in such a manner that if you die, they should weep for you, and if you live they should long for you."
  },
  {
    "saying_number": 11,
    "saying": "When you gain power over your adversary, pardon him as your way of expressing thanks [to Allah] for being able to overpower him."
  },
  {
    "saying_number": 13,
    "saying": "When you get (only) small favors, do not push them away by being ungrateful."
  },
  {
    "saying_number": 14,
    "saying": "Whoever is abandoned by near ones is dear to remote ones."
  },
  {
    "saying_number": 15,
    "saying": "Every mischief monger cannot even be reproved."
  },
  {
    "saying_number": 16,
    "saying": "All matters are subject to destiny, so much so that sometimes death results from effort."
  },
  {
    "saying_number": 17,
    "saying": "The Prophet ( ) said this at a time when the religion was confined to a few, but now that its expanse has widened and it is firmly settled, everyone is free in his action."
  },
  {
    "saying_number": 18,
    "saying": "They abandoned righteousness but did not support wrong."
  },
  {
    "saying_number": 19,
    "saying": "Whoever gallops with a loose rein collides with death."
  },
  {
    "saying_number": 20,
    "saying": "Forgive the shortcomings of considerate people because when they fall into error, Allah raises them up."
  },
  {
    "saying_number": 21,
    "saying": "The consequence of fear is disappointment and of bashfulness is frustration. Opportunity passes away like the cloud. Therefore, make use of good opportunities."
  },
  {
    "saying_number": 22,
    "saying": "We have a right. If it is granted to us, that is good; otherwise, we will ride on the hind of the camel even though the night journey may be long."
  },
  {
    "saying_number": 23,
    "saying": "If the deeds of someone accord (him) a back status, he cannot be given a front status simply on account of his lineage."
  },
  {
    "saying_number": 24,
    "saying": "To render relief to the grief-stricken and to provide comfort in hardship means the atonement of great sins."
  },
  {
    "saying_number": 25,
    "saying": "O son of Adam! When you see that your Lord, the Glorified One, bestows His favors on you while you are disobeying Him, you should fear Him."
  },
  {
    "saying_number": 26,
    "saying": "Whenever a person conceals a thing in his heart, it manifests itself through unintentional words from his tongue and (in) the expressions of his face."
  },
  {
    "saying_number": 27,
    "saying": "Keep walking in your sickness as long as you can."
  },
  {
    "saying_number": 28,
    "saying": "The best part of moderation is to conceal it."
  },
  {
    "saying_number": 29,
    "saying": "When you are running away from the world and death is approaching, there is no question of delay in the encounter."
  },
  {
    "saying_number": 30,
    "saying": "Fear! Fear! By Allah, He has hidden your sins, so much so that it is as though He has forgiven them!"
  },
  {
    "saying_number": 31,
    "saying": "Faith stands on four pillars: endurance, conviction, justice and jihad..."
  },
  {
    "saying_number": 32,
    "saying": "The doer of good is better than the good itself, and the doer of evil is worse than the evil itself."
  },
  {
    "saying_number": 33,
    "saying": "Be generous but not extravagant; be thrifty but not stingy."
  },
  {
    "saying_number": 34,
    "saying": "The best of riches is the abandonment of desires."
  },
  {
    "saying_number": 35,
    "saying": "If someone is quick in saying about people what they dislike, they will speak about him that with which they have no knowledge."
  },
  {
    "saying_number": 36,
    "saying": "Whoever prolongs his desire ruins his actions."
  },
  {
    "saying_number": 37,
    "saying": "By Allah, this does not benefit your chiefs. You are belaboring yourself in this world and earning misery for the next by it. How harmful is the labour in whose wake there is punishment, and how profitable is the case with which there is deliverance from the Fire (of Hell)!"
  },
  {
    "saying_number": 38,
    "saying": "O son! Learn four things and (a further) four things from me: Nothing will harm you if you practice them. The richest of all riches is intelligence; the biggest destitution is foolishness; the most wild of the wild is vanity, and the best achievement is goodness of the moral character. O my son! You should avoid making friends with a fool... a miser... a sinful person... and a liar."
  },
  {
    "saying_number": 39,
    "saying": "Supererogatory worship cannot bring about nearness to Allah if it hampers what is obligatory."
  },
  {
    "saying_number": 40,
    "saying": "The tongue of the wise man is behind his heart, while the heart of the fool is behind his tongue."
  },
  {
    "saying_number": 41,
    "saying": "The heart of a fool is in his mouth, while the tongue of the wise man is in his heart."
  },
  {
    "saying_number": 42,
    "saying": "May Allah make your illness a means for wiping out your sins because there is no reward for sickness but that it erases sins and makes them fall like (dried) leaves."
  },
  {
    "saying_number": 45,
    "saying": "Even if I strike the nose of a believer with this, my sword, so he may hate me, he will not hate me, and even if I pile all the wealth of the world before a hypocrite (Muslim) so he may love me, he will not love me."
  },
  {
    "saying_number": 46,
    "saying": "The sin that displeases you is better in the view of Allah than the virtue that makes you proud."
  },
  {
    "saying_number": 47,
    "saying": "The worth of a man is according to his courage, his truthfulness is according to his balance of temper, his valor is according to his self-respect and his chastity is according to his sense of shame."
  },
  {
    "saying_number": 48,
    "saying": "Victory is (won) with determination; determination is pondering over thoughts and thoughts are formed by guarding secrets."
  },
  {
    "saying_number": 49,
    "saying": "Fear the might of a noble person when he is hungry and that of an ignoble person when he is satisfied."
  },
  {
    "saying_number": 50,
    "saying": "The hearts of the people are like wild beasts. If someone tries to tame them, they will pounce back upon him."
  },
  {
    "saying_number": 51,
    "saying": "So long as your status is good, your defects will remain covered."
  },
  {
    "saying_number": 52,
    "saying": "The most capable of pardoning is whoever is the most powerful to punish."
  },
  {
    "saying_number": 53,
    "saying": "Generosity is that which is by one’s own initiative because giving on being asked is either out of self-respect or to avoid rebuke."
  },
  {
    "saying_number": 54,
    "saying": "There is no wealth like wisdom, no destitution like ignorance, no inheritance like refinement and no support like consultation."
  },
  {
    "saying_number": 55,
    "saying": "Patience is of two kinds: patience over what pains you, and patience regarding what you covet."
  },
  {
    "saying_number": 56,
    "saying": "With wealth, a strange land is a homeland, while with destitution, even a homeland is a strange land."
  },
  {
    "saying_number": 57,
    "saying": "Contentment is wealth that does not diminish."
  },
  {
    "saying_number": 58,
    "saying": "Wealth is the fountainhead of passions."
  },
  {
    "saying_number": 59,
    "saying": "One who warns you is like one who gives you good tidings."
  },
  {
    "saying_number": 60,
    "saying": "The tongue is a beast; when it is let loose, it devours."
  },
  {
    "saying_number": 61,
    "saying": "Woman is a scorpion whose touch is sweet."
  },
  {
    "saying_number": 62,
    "saying": "If you are met with a greeting, give better greetings in return. If a hand of help is extended to you, do a better favor in return, although the credit will remain with the one who was the first."
  },
  {
    "saying_number": 63,
    "saying": "One who intercedes is the wing of one who seeks."
  },
  {
    "saying_number": 64,
    "saying": "The people of the world are like travelers who are being carried while they are asleep."
  },
  {
    "saying_number": 65,
    "saying": "A lack of friends means strangeness."
  },
  {
    "saying_number": 66,
    "saying": "To miss what one needs is easier than to beg from an inappropriate person."
  },
  {
    "saying_number": 67,
    "saying": "Do not feel ashamed for giving little because refusal is smaller than that."
  },
  {
    "saying_number": 68,
    "saying": "Charity is the adornment of destitution, while gratefulness (to Allah) is the adornment of riches."
  },
  {
    "saying_number": 69,
    "saying": "If what you aim at does not come about, then do not worry as to what you were."
  },
  {
    "saying_number": 70,
    "saying": "You will not find an ignorant person but at one extreme or another (i.e. a person who neglects or a person who exaggerates)."
  },
  {
    "saying_number": 71,
    "saying": "As intelligence increases, speech decreases."
  },
  {
    "saying_number": 72,
    "saying": "Time wears out bodies, renews desires, brings death nearer and takes away aspirations. Whoever is successful with it encounters grief, and whoever misses its favors also undergoes hardships."
  },
  {
    "saying_number": 73,
    "saying": "Whoever places himself as a leader of the people should commence with educating his own self before educating others, and his teaching should be by his own conduct before teaching by the tongue."
  },
  {
    "saying_number": 74,
    "saying": "Each breath taken by a man is a step towards his death."
  },
  {
    "saying_number": 75,
    "saying": "Every countable thing is to pass way and every expected thing must come about."
  },
  {
    "saying_number": 76,
    "saying": "If matters get mixed up, then the last ones should be appreciated compared to the previous one."
  },
  {
    "saying_number": 77,
    "saying": "O world, O world! Get away from me! Why do you present yourself to me?! Or are you eager for me?! You may not get that opportunity to impress me. Deceive some other person. I have no concern with you. I have divorced you thrice after which there is no restitution."
  },
  {
    "saying_number": 78,
    "saying": "Woe unto you! You take it as a final and unavoidable destiny (according to which we are bound to act). If it were so, there would have been no question of reward or chastisement and there would have been no sense in Allah’s promises or warnings."
  },
  {
    "saying_number": 79,
    "saying": "Take wise points from wherever they may be because if a wise saying is in the bosom of a hypocrite, it flutters in his bosom till it comes out and settles with others of its own category: in the bosom of the believer."
  },
  {
    "saying_number": 80,
    "saying": "A wise saying is a lost article of the believer. Therefore, get wise sayings even though from people of hypocrisy."
  },
  {
    "saying_number": 81,
    "saying": "The worth of every man is in his attainments."
  },
  {
    "saying_number": 82,
    "saying": "None of you should repose hope save in his Lord (Allah); none of you should fear anything save his sin; none should feel ashamed of saying, “I do not know” when he is asked about a matter which he does not know; none should feel ashamed of learning a thing that he does not know and you should practice endurance..."
  },
  {
    "saying_number": 83,
    "saying": "I am below what you express and above what you feel in your heart."
  },
  {
    "saying_number": 84,
    "saying": "The survivors of the sword are large in number and have many offspring."
  },
  {
    "saying_number": 85,
    "saying": "Whoever abandons saying, “I do not know” meets his destruction."
  },
  {
    "saying_number": 86,
    "saying": "I love the opinion of an old man more than the determination of a young man: (or according to another version: more than the martyrdom of a young man.)"
  },
  {
    "saying_number": 87,
    "saying": "I wonder about the man who loses hope despite the possibility of seeking forgiveness."
  },
  {
    "saying_number": 88,
    "saying": "There were two sources of deliverance from the punishment of Allah: one of them has been raised up, while the other is before you. You should, therefore, adhere to it. The source of deliverance, which has been raised up is the Messenger of Allah Muhammad ( ), while the source of deliverance that remains is the seeking of forgiveness."
  },
  {
    "saying_number": 89,
    "saying": "If a man behaves properly in matters between himself and Allah, then Allah will keep proper the matters between him and other people. And if a man keeps proper the affairs of his next life, then Allah keeps proper for him the affairs of this world. Whoever is a preacher for himself is protected by Allah."
  },
  {
    "saying_number": 90,
    "saying": "The perfect jurist of Islam is whoever does not let people lose hope from the mercy of Allah, does not make him despondent of Allah’s kindness and does not make him feel safe from Allah’s punishment."
  },
  {
    "saying_number": 91,
    "saying": "The hearts get disgusted as bodies get disgusted; so look for beautiful wise sayings for them."
  },
  {
    "saying_number": 92,
    "saying": "The most humble knowledge is that which remains on the tongue and the most honorable one is that which manifests itself through (the action of) the limbs and the organs of the body."
  },
  {
    "saying_number": 93,
    "saying": "None of you should say, “O Allah! I seek Your protection from affliction” because there is none who is not afflicted. But whoever seeks Allah’s protection should seek it from misguiding troubles..."
  },
  {
    "saying_number": 94,
    "saying": "Good is not that your wealth and progeny should be much, but good is that your knowledge should be much, your forbearance should be great and that you should vie with other people in worshipping Allah."
  },
  {
    "saying_number": 95,
    "saying": "Action accompanied by fear for Allah does not fail; how can a thing fail that has been accepted?!"
  },
  {
    "saying_number": 96,
    "saying": "The friend of Muhammad ( ) is whoever obeys Allah, even though he may have no blood relationship [with him], and the enemy of Muhammad ( ) is whoever disobeys Allah even though he may have near kinship [with the Prophet ( )]."
  },
  {
    "saying_number": 97,
    "saying": "Sleeping in a state of firm belief is better than praying in a state of doubt."
  },
  {
    "saying_number": 98,
    "saying": "When you hear a tradition, test it according to the criterion of intelligence not to that of mere hearsay because those who relate knowledge are numerous, but those who safeguard it are few."
  },
  {
    "saying_number": 99,
    "saying": "Our saying, “Inna li’llah (Verily we are Allah’s) is an admission of His majesty over us, while our saying, “Wa inna ilayhi raji’un” (and verily to Him shall we return) is an admission of our being mortal."
  },
  {
    "saying_number": 100,
    "saying": "O Lord! You know me better than I know myself, and I know myself better than they know. O Lord! Make us better people than what they think and forgive us for what they do not know."
  },
  {
    "saying_number": 101,
    "saying": "The fulfillment of (others’) needs becomes a lasting virtue in three ways: regarding it as small, so that it attains bigness, concealing it so that it may manifest itself, and doing it quickly so that it becomes pleasant."
  },
  {
    "saying_number": 102,
    "saying": "Shortly, a time will come for people when high [government] positions will be given only to those who defame others, when vicious people will be regarded as witty and just will be regarded as weak."
  },
  {
    "saying_number": 103,
    "saying": "With it [such shabbiness of dressing] the heart fears, the mind feels humble and the believers emulate it. Certainly this world and the next are two enemies of each other, two paths in opposite directions."
  },
  {
    "saying_number": 104,
    "saying": "O Nawf! Blessed be those who abstain from this world and are eager for the next one. They are the people who regard this earth as the floor; its dust as their bed-cloth, and its water as their perfume."
  },
  {
    "saying_number": 105,
    "saying": "Allah has placed on you some obligations which you should not ignore, has laid down for you limits which you should not transgress, has prohibited you from certain things which you should not violate and has kept quiet about certain things, but He has not left them out by mistake so that you should not find them."
  },
  {
    "saying_number": 106,
    "saying": "If people give up something relevant to religion to set right their worldly affairs, Allah will inflict upon them something more harmful than that."
  },
  {
    "saying_number": 107,
    "saying": "Often the ignorance of a learned man ruins him while the knowledge he has does not avail him."
  },
  {
    "saying_number": 108,
    "saying": "In man, there is a piece of flesh attached to him: a vein, and it is the strangest thing in him. It is the heart. It has a store of wisdom and things contrary to wisdom."
  },
  {
    "saying_number": 109,
    "saying": "We (members of the Prophet’s family) are like the pillow in the middle. Whoever lags behind has to come forward to meet it, while whoever exceeds the bounds has to return to it."
  },
  {
    "saying_number": 110,
    "saying": "None can establish the rule of All h, the Glorified One, except whoever shows no relenting (in the matter of right), who does not behave like wrong doers and who does not run after greed."
  },
  {
    "saying_number": 111,
    "saying": "Even if a mountain had loved me, it will have crumbled down."
  },
  {
    "saying_number": 112,
    "saying": "Whoever loves us, members of the Household (of the Prophet [ ]), should be prepared to face destitution."
  },
  {
    "saying_number": 113,
    "saying": "No wealth is more profitable than wisdom; no loneliness is more estranging than vanity, no wisdom is as good as tact, no honor is like fear from Allah, no companion is like the goodness of moral character..."
  },
  {
    "saying_number": 114,
    "saying": "At a time when virtue is in vogue in the world and among people, if a person entertains an evil suspicion about another person from whom nothing evil has ever been seen, then he has been unjust."
  },
  {
    "saying_number": 115,
    "saying": "How can he be whom life is driving towards death, whose state of health can change into sickness any moment and who is to be caught (by death) from his place of safety."
  },
  {
    "saying_number": 116,
    "saying": "There are many people who are given time (by Allah) through good treatment towards them and many who are deceived because their sinful activities are veiled (by Allah) and many who are impressed by good talk about themselves."
  },
  {
    "saying_number": 117,
    "saying": "Two categories of persons will face ruin on my account: whoever exaggerates in loving me and whoever hates me intensely."
  },
  {
    "saying_number": 118,
    "saying": "To miss an opportunity brings about grief."
  },
  {
    "saying_number": 119,
    "saying": "The example of the world is like a serpent: It is soft in touch but its inside is full of venom. An ignorant person who has fallen into deceit is attracted towards it, but a wise and intelligent man stays on guard against it."
  },
  {
    "saying_number": 120,
    "saying": "As for Banu Makhzum, they are the blossoms of the tribesmen of Quraish. It is delightful to talk to their men and to marry their women. As for Ban Abd Shams, they are far-sighted and cautious about all that is hidden from them. As for ourselves (Banu Hashim), we spend whatever we get and are very generous in offering ourselves to death."
  },
  {
    "saying_number": 121,
    "saying": "What a difference there is between two kinds of actions: A deed whose pleasure passes away but its (ill) consequence remains, and a deed whose hardship passes away but its reward stays."
  },
  {
    "saying_number": 122,
    "saying": "Is it that death has been ordained only for others? Is it that right is obligatory only on others? Is it that those whom we see departing on their journey of death will come back to us?"
  },
  {
    "saying_number": 123,
    "saying": "Blessed be whoever humbles himself, whose livelihood is pure, whose heart is chaste, whose habits are virtuous, who spends his savings (in the name of Allah), who prevents his tongue from speaking nonsense..."
  },
  {
    "saying_number": 124,
    "saying": "The jealousy of a woman (with co-wives) is heresy, while the jealousy of a man is a part of belief."
  },
  {
    "saying_number": 125,
    "saying": "I am defining Islam as none has defined it before me: Islam is submission, submission is conviction, conviction is affirmation, affirmation is acknowledgment, acknowledgment is carrying out (of obligations) and carrying out obligations is action."
  },
  {
    "saying_number": 126,
    "saying": "I wonder at the miser who is speeding towards the very destitution from which he wants to run away and misses the very ease of life which he covets. Consequently, he passes his life in this world like the destitute but will have to render an account in the next world like the rich."
  },
  {
    "saying_number": 127,
    "saying": "Whoever falls short of actions falls into grief, and Allah has nothing to do with him who spares nothing from his wealth in the name of Allah."
  },
  {
    "saying_number": 128,
    "saying": "Guard yourselves against cold in its (seasonal) beginning and welcome it towards its end because it affects bodies in the same way as it affects plants. In the beginning, it destroys them, but in the end it gives them fresh leaves."
  },
  {
    "saying_number": 129,
    "saying": "The Greatness of the Creator appreciated by you will belittle the creatures in your view."
  },
  {
    "saying_number": 130,
    "saying": "O residents of houses which give a sense of loneliness, of depopulated areas, of gloomy graves! O people of the dust! O victims of strangeness! O people of loneliness and O people of desolateness! You have gone ahead and preceded us while we are following you and will join you."
  },
  {
    "saying_number": 131,
    "saying": "O you who abuses the world! O you who has been deceived by it and cheated by its wrongs! Do you thus covet the world then abuse it?! Do you accuse it or should it accuse you?! When did it bewilder you or deceive you...?"
  },
  {
    "saying_number": 132,
    "saying": "There is an angel of Allah who calls out every day: “Beget children for death! Collect wealth for destruction and raise construction for ruin!”"
  },
  {
    "saying_number": 133,
    "saying": "This world is a transient place, not a place of stay. The people herein are of two types: One is a man who sold away his soul (to his passions) and thus ruined it, and the other is a man who purchased his soul (by controlling his desires) and freed it."
  },
  {
    "saying_number": 134,
    "saying": "A friend is not a friend unless he affords protection to his comrade on three occasions: in his adversity, in his absence and at the time of his death."
  },
  {
    "saying_number": 135,
    "saying": "Whoever is bestowed four things is not disallowed four things: whoever is allowed to pray is not deprived of the response to it; whoever is allowed to offer repentance is not deprived of its acceptance; whoever is allowed to seek forgiveness is not deprived of forgiveness, and whoever is allowed to be grateful is not deprived of furtherance of favors."
  },
  {
    "saying_number": 136,
    "saying": "For the God-fearing, prayers is a means of seeking nearness to Allah, and for the weak, the hajj is as good as jihad. For everything there is a tax, and the tax of the body is fasting. The jihad of a woman is to afford pleasant company to her husband."
  },
  {
    "saying_number": 137,
    "saying": "Seek livelihood by giving alms."
  },
  {
    "saying_number": 138,
    "saying": "Whoever is sure of a good return is generous in giving."
  },
  {
    "saying_number": 139,
    "saying": "Assistance is allowed according to need."
  },
  {
    "saying_number": 140,
    "saying": "Whoever is moderate does not become destitute."
  },
  {
    "saying_number": 141,
    "saying": "A small family is one of the ways of (securing) ease."
  },
  {
    "saying_number": 142,
    "saying": "Loving one another is half the measure of wisdom."
  },
  {
    "saying_number": 143,
    "saying": "Grief is half the old age."
  },
  {
    "saying_number": 144,
    "saying": "Endurance comes according to affliction. Whoever beats his hand on the thigh in his affliction ruins all his good actions."
  },
  {
    "saying_number": 145,
    "saying": "There are many who fast but whose fast is nothing more than hunger and thirst. There are many who offer of prayers and whose prayer is no better than wakefulness and hardship: the sleep as well as the eating and drinking of the intelligent (God-fearing) person is far better."
  },
  {
    "saying_number": 146,
    "saying": "Protect your belief by charity; guard your wealth by paying Allah’s share thereof, and ward off the waves of calamity by praying."
  },
  {
    "saying_number": 147,
    "saying": "O Kumayl these hearts are containers. The best of them is that which preserves (its contents); so, preserve what I say to you: People are of three types: One is the scholar and the Divine. Then, the seeker of knowledge who is also on the way to deliverance. Then the common rot who runs after every caller and bends in the direction of every wind."
  },
  {
    "saying_number": 148,
    "saying": "Man is hidden under his tongue. You cannot know his worth and value."
  },
  {
    "saying_number": 149,
    "saying": "Whoever does not know his own worth is ruined."
  },
  {
    "saying_number": 150,
    "saying": "Do not be like him who hopes for (bliss in) the next life without action and delays repentance by prolonging his desires, who utters words like ascetics in this world but whose deeds are like those who are eager for it."
  },
  {
    "saying_number": 151,
    "saying": "Every human being has to meet the end, sweet or sour."
  },
  {
    "saying_number": 152,
    "saying": "Every comer has to return, and after returning, it is as though he never existed."
  },
  {
    "saying_number": 153,
    "saying": "The one who endures does not miss success although it may take a long time."
  },
  {
    "saying_number": 154,
    "saying": "Whoever agrees with the action of a group of persons is as though he joins them in that action. And everyone who joins in wrong commits two sins: one sin for committing the wrong and the other for agreeing with it."
  },
  {
    "saying_number": 155,
    "saying": "Adhere to your covenants and entrust their fulfillment to steadfast persons."
  },
  {
    "saying_number": 156,
    "saying": "On you lies (the obligation of) obedience to the person about whom you cannot plead the excuse of ignorance. But it will ever remain on the oppressor."
  },
  {
    "saying_number": 157,
    "saying": "Your minds are opened when you see, and you are guided when you receive guidance, and you are made to hear when you do hear."
  },
  {
    "saying_number": 158,
    "saying": "Remonstrate with your brother by being kind to him, and respond to his evil by being generous to him."
  },
  {
    "saying_number": 159,
    "saying": "If one places himself where he may be charged, let him not blame those who may think ill of him."
  },
  {
    "saying_number": 160,
    "saying": "One who possesses prefers himself over others."
  },
  {
    "saying_number": 161,
    "saying": "One who follows only his view perishes, and one who consults with others shares their wisdom"
  },
  {
    "saying_number": 162,
    "saying": "One who hides his secret holds his own option,."
  },
  {
    "saying_number": 163,
    "saying": "Poverty is the greatest death."
  },
  {
    "saying_number": 164,
    "saying": "If one is fair to another who is not fair to him, it is as though he worships him."
  },
  {
    "saying_number": 165,
    "saying": "No creature should be obeyed so long as such obedience means disobedience of the Creator."
  },
  {
    "saying_number": 166,
    "saying": "No blame should be placed on one in delaying taking what belongs to him; blame should be on one who takes what does not belong to him."
  },
  {
    "saying_number": 167,
    "saying": "Conceit stops one from seeking perfection."
  },
  {
    "saying_number": 168,
    "saying": "The undertaking is near, but company is not."
  },
  {
    "saying_number": 169,
    "saying": "Morning surely shines for those who have vision."
  },
  {
    "saying_number": 170,
    "saying": "Abandoning a sin is easier than seeking help."
  },
  {
    "saying_number": 171,
    "saying": "How often one meal blocks many!"
  },
  {
    "saying_number": 172,
    "saying": "People are enemies of what they do not know."
  },
  {
    "saying_number": 173,
    "saying": "One who welcomes various views gets to know where error lies."
  },
  {
    "saying_number": 174,
    "saying": "One who sharpens his weapon seeking revenge against those who incur the Wrath of Allah will be strong enough to kill those who are strong in committing falsehood."
  },
  {
    "saying_number": 175,
    "saying": "If you fear doing something, then do it because your fear is greater than the deed itself."
  },
  {
    "saying_number": 176,
    "saying": "The mechanism whereby one earns mastership is forbearance."
  },
  {
    "saying_number": 177,
    "saying": "Reprimand the evil doer by rewarding the doer of righteous-ness."
  },
  {
    "saying_number": 178,
    "saying": "Remove evil from the chest of others by eradicating it from your own."
  },
  {
    "saying_number": 179,
    "saying": "Fanatically insisting on disagreeing poisons one’s view."
  },
  {
    "saying_number": 180,
    "saying": "Greed is perpetual bondage."
  },
  {
    "saying_number": 181,
    "saying": "The fruit of carelessness is regret, whereas the fruit of determination is safety."
  },
  {
    "saying_number": 182,
    "saying": "Preferring silence over articulating wisdom produces nothing good; likewise is to speak out of ignorance."
  },
  {
    "saying_number": 183,
    "saying": "No two cases vary from each other except that one of them is falsehood."
  },
  {
    "saying_number": 184,
    "saying": "Never have I ever doubted the truth whenever it was shown to me."
  },
  {
    "saying_number": 185,
    "saying": "Never have I told a lie, nor was I ever called a liar. Never did I ever stray, nor could any use me to cause others to stray."
  },
  {
    "saying_number": 186,
    "saying": "The oppressor who starts the oppression will tomorrow bite his hand (in regret)."
  },
  {
    "saying_number": 187,
    "saying": "Departure (from this world) is nigh."
  },
  {
    "saying_number": 188,
    "saying": "One who openly opposes what is right perishes."
  },
  {
    "saying_number": 189,
    "saying": "One who is not saved by patience will be finished by impatience."
  },
  {
    "saying_number": 190,
    "saying": "How strange! Should caliphate be obtained through friends and relatives?!"
  },
  {
    "saying_number": 191,
    "saying": "One in this life is a target of death, a loot to calamities. With every sip there is hardship, with every morsel there is pain. Whenever a servant of Allah receives a blessing, he bids farewell to another."
  },
  {
    "saying_number": 192,
    "saying": "O son of Adam! Anything you earn beyond your need is stored for others."
  },
  {
    "saying_number": 193,
    "saying": "Hearts have desires, coming or going; so, approach your hearts according to their desires and approaches, for if you force the heart, you will blind it."
  },
  {
    "saying_number": 194,
    "saying": "What shall I satisfy my anger when I am enraged? Is it when I am unable to seek revenge, so it will be said to me: “Why did you not have patience?” Or should I do it when I am able, so it will be said to me: “Why did you not forgive?”!"
  },
  {
    "saying_number": 195,
    "saying": "This is some people were too miser to give others."
  },
  {
    "saying_number": 196,
    "saying": "None of your wealth was wasted so long as it provided you with admonishment."
  },
  {
    "saying_number": 197,
    "saying": "These hearts wear out just as bodies wear out; so, seek for them beautiful pieces of wisdom"
  },
  {
    "saying_number": 198,
    "saying": "A true statement intended to reap falsehood."
  },
  {
    "saying_number": 199,
    "saying": "They are the ones who overwhelm when they gather and who are known when they disperse."
  },
  {
    "saying_number": 200,
    "saying": "There is no welcome for you here, O faces that are not seen except when a bad deed is committed."
  },
  {
    "saying_number": 201,
    "saying": "With every human being, there are two guardian angels. When fate comes, they make room for him; fate is a secure protection.."
  },
  {
    "saying_number": 202,
    "saying": "No, but you both are partners when strength and aid are sought, and you both are aides against inability and extreme effort."
  },
  {
    "saying_number": 203,
    "saying": "O people! Fear Allah Who hears you when you speak, Who knows what you hide in your breasts, and be more swift than death which catches up with you when you flee, which take you when you stay, and which remembers you when you forget about it."
  },
  {
    "saying_number": 204,
    "saying": "Do not be discouraged by ingrates from doing good deeds, for you may be thanked by those who do not benefit from your good deed and who still are grateful to you for it."
  },
  {
    "saying_number": 205,
    "saying": "Every container becomes straitened by what is put in it except the container of knowledge: It expands."
  },
  {
    "saying_number": 206,
    "saying": "The first compensation for a clement person for his clemency is that people are his supporters against the ignorant ones."
  },
  {
    "saying_number": 207,
    "saying": "If you are not clement, then put on the garb of clemency, for many are those who imitate others and who become almost just like them."
  },
  {
    "saying_number": 208,
    "saying": "One who holds himself to account succeeds. When who overlooks it loses. One who is cautious earns security. One who receives admonishment expands his vision. One who expands his vision gains understanding, and who gains understanding earns knowledge."
  },
  {
    "saying_number": 209,
    "saying": "The life of this world shall be kind to us after being cruel to us just as a she-camel that rejects those who milk it but turns with affection to its newborn."
  },
  {
    "saying_number": 210,
    "saying": "Fear Allah like one who is willing to risk everything [just to please All h], who urges himself to walk towards Allah, who starts in awe, who looks into the outcomes of matters, into the penalty of anything forbidden, who is apprehensive of the final end."
  },
  {
    "saying_number": 211,
    "saying": "Generosity is the guard of honors. Clemency is ship’s restrainer. Forgiveness is the zakat of victory. Solace is your compensation for one who betrayed you. Consultation is the same as guidance. One who sticks only to his own view takes a risk. Patience struggles against calamities. Impatience aids against time’s fluctuations. The best of wealth is to abandon high hopes. How many are the minds that are subdued by aggressive desires! A sign of success is to remember experience. Affection is a useful kinship. And do not place your trust in someone who has no patience."
  },
  {
    "saying_number": 212,
    "saying": "One’s self-conceit is one of the envies of his own mind."
  },
  {
    "saying_number": 213,
    "saying": "Overlook imperfections and pains and you will always be pleased."
  },
  {
    "saying_number": 214,
    "saying": "One whose stem is lean, his leaves will be thick."
  },
  {
    "saying_number": 215,
    "saying": "Disputes destroy views."
  },
  {
    "saying_number": 216,
    "saying": "One who wins becomes greater."
  },
  {
    "saying_number": 217,
    "saying": "In the alterations of conditions lies the knowledge of the gems of men."
  },
  {
    "saying_number": 218,
    "saying": "Envying a friend is a sign of fault in one’s friendship."
  },
  {
    "saying_number": 219,
    "saying": "Most places where minds are conquered fall under the glitter of high hopes."
  },
  {
    "saying_number": 220,
    "saying": "It is not fair to put an end to trust by entertaining doubt."
  },
  {
    "saying_number": 221,
    "saying": "How miserable the ration of a servant of All h to the Hereafter is if he oppresses All h’s servants!"
  },
  {
    "saying_number": 222,
    "saying": "The very best of a generous man’s acts of generosity is that he is mindless of what he knows (of people’s faults)."
  },
  {
    "saying_number": 223,
    "saying": "One who is attired with the outfit of modesty, people never see his fault."
  },
  {
    "saying_number": 224,
    "saying": "Through abundance of silence does one earn respect. Through fairness does one win lovers. Through acts of favors does one’s value get greater. Through humility does one’s blessing become complete. Through bearing hardships, loftiness is earned. Through fair dealing, an opponent is subdued. And through clemency with regard to a shallow-minded person does one earn supporters."
  },
  {
    "saying_number": 225,
    "saying": "How strange it is that the envious ones overlook the soundness of their own bodies!"
  },
  {
    "saying_number": 226,
    "saying": "A covetous person is tied with the ropes of humiliation."
  },
  {
    "saying_number": 227,
    "saying": "Im n is a knowledge with the heart, an admission with the tongue, and an action according to the [Islamic] injunctions."
  },
  {
    "saying_number": 228,
    "saying": "If one becomes sad about this world, he becomes angry with what All h decrees. One who complains about a calamity that befell him, he complains against his Lord. And one who goes to a wealthy man and humbles himself to him on account of his wealth wipes out two-thirds of his creed."
  },
  {
    "saying_number": 229,
    "saying": "Satisfaction suffices for wealth and good manners for a bliss."
  },
  {
    "saying_number": 230,
    "saying": "Be partners of one to whom sustenance go for this is the best means for acquiring wealth and the most worthy of earning a good luck."
  },
  {
    "saying_number": 231,
    "saying": "Justice means equity, while kindness is doing others favors."
  },
  {
    "saying_number": 232,
    "saying": "If one gives with the short hand, he will be given with the long one."
  },
  {
    "saying_number": 233,
    "saying": "Do not invite anyone to a duel, but if you are called upon to duel, respond, because one who calls to a duel is an oppressor, and the oppressor is always defeated."
  },
  {
    "saying_number": 234,
    "saying": "The best of women’s attributes are the men’s worst: self-conceit, cowardice and miserliness. So if a woman is self-conceited, she will not let one approach her (in bed). If she is miser, she safeguards her wealth and that of her husband. And if she is a coward, she is scared of anything displayed before her."
  },
  {
    "saying_number": 235,
    "saying": "He is the one who puts everything in its right place."
  },
  {
    "saying_number": 236,
    "saying": "By All h! Your world is cheaper in my eyes than the intestines of a pig in the hands of leper."
  },
  {
    "saying_number": 237,
    "saying": "Some people worship All h out of their desire (to worship Him). Such is the worship of traders. Some people worship Allah out of fear of Him; such is the worship of slaves. And some people worship Allah to thank Him; such is the worship of the free."
  },
  {
    "saying_number": 238,
    "saying": "Woman is evil, and the worst of her evil is that we cannot do without her!"
  },
  {
    "saying_number": 239,
    "saying": "One who obeys postponements loses track of rights. One who obeys a taleteller loses friends."
  },
  {
    "saying_number": 240,
    "saying": "A rock taken by force in the building of a house is a pawn for its destruction."
  },
  {
    "saying_number": 241,
    "saying": "The oppressed one’s day (of judgment) is to the oppressor much more hard than the day of the oppressor against the oppressed."
  },
  {
    "saying_number": 242,
    "saying": "If many answers crowd together, the truth is hidden."
  },
  {
    "saying_number": 243,
    "saying": "Fear All h to some degree (even) though it may be little, and set a curtain between you and All h (even) though it may be thin."
  },
  {
    "saying_number": 244,
    "saying": "When replies are numerous, the correct point remains obscure."
  },
  {
    "saying_number": 245,
    "saying": "Surely in every blessing there is a right of Allah. If one carries out that right, Allah increases the blessing, and if one falls short of doing so, one stands in danger of losing the blessing."
  },
  {
    "saying_number": 246,
    "saying": "When capability increases, desire decreases."
  },
  {
    "saying_number": 247,
    "saying": "Keep on guard against the slipping away of blessings because not everything that runs away comes back."
  },
  {
    "saying_number": 248,
    "saying": "Generosity is more prompting to good than regard for kinship."
  },
  {
    "saying_number": 249,
    "saying": "If a person has a good idea about you, make his idea come true."
  },
  {
    "saying_number": 250,
    "saying": "The best deed is that which you have to force yourself to do."
  },
  {
    "saying_number": 251,
    "saying": "I came to know All h, the Glorified One, through breaking determinations, a change of intentions and the loss of courage."
  },
  {
    "saying_number": 252,
    "saying": "The sourness of this world is the sweetness of the next while the sweetness of this world is the sourness of the next."
  },
  {
    "saying_number": 253,
    "saying": "All h has laid down iman (conviction) for purification from polytheism; salat (prayer) for purification from vanity; zakat as a means of livelihood; siyam (fasting) as a trial of the people; hajj for the honor of Islam; persuasion for good (al-amr bil-ma‘ruf) for the good of the common people..."
  },
  {
    "saying_number": 254,
    "saying": "If you want an oppressor to take an oath, ask him to swear like this: that he is out of All h’s might and power, because if he swears falsely in this way, he will be swiftly punished..."
  },
  {
    "saying_number": 255,
    "saying": "O son of Adam! Be your own representative in the matter of your property, and do about it whatever you want to be done with it after your death."
  },
  {
    "saying_number": 256,
    "saying": "Anger is a kind of madness because the victim to it repents afterwards. If he does not repent his madness is confirmed."
  },
  {
    "saying_number": 257,
    "saying": "Health of body comes from paucity of envy."
  },
  {
    "saying_number": 258,
    "saying": "O Kumayl! Direct your people to go out in the day to achieve noble traits and to go out in the night to meet the needs of those who might be sleeping, for I swear by the One Whose hearing extends to all voices, if someone pleases another’s heart, All h will create a special thing out of this pleasing..."
  },
  {
    "saying_number": 259,
    "saying": "When you fall in destitution, trade with All h through charity."
  },
  {
    "saying_number": 260,
    "saying": "Faithfulness with faithless people is faithlessness with All h, while faithlessness with faithless people is faithfulness with All h."
  },
  {
    "saying_number": 261,
    "saying": "There is many a man being gradually brought towards punishment by good treatment with him; many a man who remains in deceit because his evils are covered, and many a man who is in illusion because of good talk about him..."
  },
  {
    "saying_number": 262,
    "saying": "When the situation is like this, then the head of the religion will rise and people will gather around him as pieces of rainless cloud gather during autumn..."
  },
  {
    "saying_number": 263,
    "saying": "He is a versatile speaker."
  },
  {
    "saying_number": 264,
    "saying": "Quarrels bring about ruin."
  },
  {
    "saying_number": 265,
    "saying": "When girls come of age, relatives on the father’s side are preferable."
  },
  {
    "saying_number": 266,
    "saying": "Faith produces a “Alumazah” in the heart. As faith develops, “Alumazah” also increases."
  },
  {
    "saying_number": 267,
    "saying": "If a man has “ad-daynu’z-zanun” (i.e. doubtful loan), it is his duty to pay zakat thereon for all the past years when he recovers it."
  },
  {
    "saying_number": 268,
    "saying": "i’dhibu (turn away) from women as far as you can."
  },
  {
    "saying_number": 269,
    "saying": "... Like the successful shooter (al-yasir al-falij) who looks forward to achieving success at his first shot."
  },
  {
    "saying_number": 271,
    "saying": "You cannot be enough for me against yourselves, so how can you be enough for me against others? Before me, the people used to complain of the oppression of their rulers, but now I have to complain of the wrongful actions of my people..."
  },
  {
    "saying_number": 272,
    "saying": "O al-Harith! You have seen below yourself but not above yourself, so you have been confused. Certainly, you have known right, so that you can recognize the righteous. And you have not known wrong, so that you can recognize the people who are wrong!"
  },
  {
    "saying_number": 273,
    "saying": "One who holds authority is like one who rides a lion; he is envied for his status but he well knows it."
  },
  {
    "saying_number": 274,
    "saying": "Do good with the bereaved ones of others so that good is done to your bereaved ones, too."
  },
  {
    "saying_number": 275,
    "saying": "When the utterance of the wise is to the point, it serves as a cure, but if it is wrong, it acts like an illness."
  },
  {
    "saying_number": 276,
    "saying": "Come to me tomorrow so that I may enlighten you in the presence of all people; thus, if you forget what I say, others might retain it. This is so because an utterance is like a fluttering prey which may be grappled by someone but missed by others."
  },
  {
    "saying_number": 277,
    "saying": "O son of Adam! Do not inflict the worry of the day that has not yet come on the day which has already come because if that day is in your life, Allah will also bestow its livelihood."
  },
  {
    "saying_number": 278,
    "saying": "Have love for your friend up to a limit, for it is possible that he may turn into your enemy some day. And hate your enemy up to a limit, for it is possible that he may turn into your friend some day."
  },
  {
    "saying_number": 279,
    "saying": "There are two kinds of workers in the world. One is a person who works in this world for this world and his work for this world keeps him unmindful of the next... The other is one who works in this world for what is to come hereafter, and he secures his share of this world without an effort."
  },
  {
    "saying_number": 280,
    "saying": "When the Quran was revealed to the Prophet ( ), there were four kinds of property: One, the property of a Muslim which he distributed among the successors according to fixed shares. Second, the tax (fay’) which he distributed to those for whom it was meant. Third, the one-fifth (khums) for which Allah had fixed the ways of disposal. Fourth, the amounts of charity (sadaqat) the disposal of which was also fixed by Allah. The ornaments of the Ka‘bah did exist in those days, but Allah left them as they were... Therefore, you should keep them where Allah and His Prophet placed them."
  },
  {
    "saying_number": 281,
    "saying": "As for this one who has stolen the public property, there is no punishment for him, for it means one who is the property of Allah has taken another property of Allah. As for the other, he should be punished."
  },
  {
    "saying_number": 282,
    "saying": "If my steps acquire firmness out of these slippery places, I will alter several things."
  },
  {
    "saying_number": 283,
    "saying": "Know with full conviction that All h has not fixed for any person more livelihood than what has been ordained in the Book of Destiny, even though his means (of seeking it) may be great, his craving for it intense and his efforts for it acute..."
  },
  {
    "saying_number": 284,
    "saying": "Do not turn your knowledge into ignorance or your conviction into doubt. When you gain knowledge act (upon it), and when you acquire conviction, proceed (on its basis)."
  },
  {
    "saying_number": 285,
    "saying": "Greed takes a person to the watering place but brings him back without letting him drink. It undertakes responsibility but does not fulfil it. Often, the drinker gets choked before he quenches his thirst. The greater the worth of a thing yearned for, the greater is the grief for its loss. Desires blind the eyes of understanding. The destined share will reach him who does not approach it."
  },
  {
    "saying_number": 286,
    "saying": "O All h! I seek Your protection from this: that I may appear to be good in the eyes of the people while my inward self may be sinful before You, and that I may guard myself (from sinning) only for show before the people although You are aware of everything about me."
  },
  {
    "saying_number": 287,
    "saying": "I swear by the One Who let us pass the dark night after which there was a bright day that such and such did not happen."
  },
  {
    "saying_number": 288,
    "saying": "A small action which is continued with regularity is more beneficial than a long one performed with grudge."
  },
  {
    "saying_number": 289,
    "saying": "When optional issues stand in the way of obligatory ones, abandon them."
  },
  {
    "saying_number": 290,
    "saying": "Whoever keeps in view the distance of the journey remains prepared."
  },
  {
    "saying_number": 291,
    "saying": "Perception by the eyes is not real observation because the eyes sometimes deceive people; but wisdom does not deceive whomsoever it counsels."
  },
  {
    "saying_number": 292,
    "saying": "Between you and preaching there is a curtain of deception."
  },
  {
    "saying_number": 293,
    "saying": "The ignorant among you get too much while the learned are just put off."
  },
  {
    "saying_number": 294,
    "saying": "Knowledge dispels the excuse of those who advance excuses."
  },
  {
    "saying_number": 295,
    "saying": "Anyone whom death overtakes early seeks time while the death of anyone who is deferred puts forth excuses for the postponement (of doing good deeds)."
  },
  {
    "saying_number": 296,
    "saying": "For every thing to which people say “how good!” there is an evil hidden in this world."
  },
  {
    "saying_number": 297,
    "saying": "It is a dark path; do not tread upon it. It is a deep ocean; do not dive in it. And it is the secret of Allah; do not take trouble about (knowing) it."
  },
  {
    "saying_number": 298,
    "saying": "When All h intends to humiliate a person, He denies him knowledge."
  },
  {
    "saying_number": 299,
    "saying": "In the past, I had a brother-in-faith, and he was prestigious in my view because the world was humble in his eyes, the needs of the stomach did not have a sway over him. He did not long for what he did not get. If he got a thing, he would not ask for more. He remained most of the time silent."
  },
  {
    "saying_number": 301,
    "saying": "O Ash‘ath! If you grieve over your son, certainly it is the consequence of the blood relationship; but if you endure, then All h provides recompense for every affliction."
  },
  {
    "saying_number": 302,
    "saying": "Certainly endurance is good except about you. Fretting is bad except over you. And the affliction about you is great while every other affliction before or after it is small."
  },
  {
    "saying_number": 303,
    "saying": "Do not associate with a fool because he will beautify his actions before you and wish that you, too, be like him."
  },
  {
    "saying_number": 304,
    "saying": "A day’s trip for the sun."
  },
  {
    "saying_number": 305,
    "saying": "Your friends are three and your enemies are (also) three. Your friends are: your friend, your friend’s friend and your enemy’s enemy. And your enemies are: your enemy, your friend’s enemy and your enemy’s friend."
  },
  {
    "saying_number": 306,
    "saying": "You are like one who pierces a spear through himself in order to kill the person sitting behind him."
  },
  {
    "saying_number": 307,
    "saying": "How many are the objectives of lessons, but how few are those who take lessons!"
  },
  {
    "saying_number": 308,
    "saying": "Whoever goes too far in quarreling is a sinner, but if one falls short in it, one is oppressed, and it is difficult for a quarreling person to fear Allah."
  },
  {
    "saying_number": 309,
    "saying": "I am not worried about a fault after which I get time to offer prayers in two units (rek‘as) and beg safety from the wrath of All h."
  },
  {
    "saying_number": 310,
    "saying": "Just as He provides them livelihood despite their large number."
  },
  {
    "saying_number": 311,
    "saying": "Your messenger is the interpreter of your intelligence while your letter is more eloquent in expressing your true self."
  },
  {
    "saying_number": 312,
    "saying": "The person who is afflicted with hardship is not in a greater need for praying than the one who has been spared affliction but is not immune to it."
  },
  {
    "saying_number": 313,
    "saying": "People are the progeny of the world and none can be blamed for loving the mother."
  },
  {
    "saying_number": 314,
    "saying": "The destitute person is a messenger of Allah. Whoever denies him denies Allah, and whoever gives him gives Allah."
  },
  {
    "saying_number": 315,
    "saying": "A self-respecting man never commits adultery."
  },
  {
    "saying_number": 316,
    "saying": "The fixed limit of life is enough to remain watchful."
  },
  {
    "saying_number": 317,
    "saying": "A man can sleep over the death of his child but cannot sleep over the loss of his property."
  },
  {
    "saying_number": 318,
    "saying": "Mutual affection between fathers creates a relationship between the sons. Relationship is more in need of affection than affection is for a relationship."
  },
  {
    "saying_number": 319,
    "saying": "Be afraid of the thoughts of believers because Allah, the most Exalted One, has placed the truth on their tongues."
  },
  {
    "saying_number": 320,
    "saying": "The belief of a person cannot be regarded as true unless his trust in what is with All h is more than his trust in what he himself has."
  },
  {
    "saying_number": 321,
    "saying": "If you are speaking a lie, Allah will afflict you with white spots (leucoderm) which even the turban may not cover."
  },
  {
    "saying_number": 322,
    "saying": "Sometimes the hearts advance [towards their Creator] and sometimes they retreat. When they advance, get them to perform the optional [acts of worship] (as well). But when they retreat, keep them confined to only what is obligatory."
  },
  {
    "saying_number": 323,
    "saying": "The Quran contains news about the past, foretelling about the future and commandments for the present."
  },
  {
    "saying_number": 324,
    "saying": "Throw a stone in return from where one comes to you because evil can be met only with evil."
  },
  {
    "saying_number": 325,
    "saying": "Put cotton flake in the ink pot, keep the nib of your pen long, leave some space between the lines and close up the letters because this is good for the beauty of the writing."
  },
  {
    "saying_number": 326,
    "saying": "I am the ya‘s b (leader) of the believers, while wealth is the leader of the wicked."
  },
  {
    "saying_number": 327,
    "saying": "We did not differ about him; we differed after him (i.e. about his succession). You had not dried up your feet yet, having come out of the river, when you began asking your Prophet: ‘Make you for us a god as they have gods of their own.’ Said he; ‘Verily you are a people behaving ignorantly’ (Quran, 7: 138)."
  },
  {
    "saying_number": 329,
    "saying": "O my son! I fear lest destitution overtakes you. So, you should seek Allah’s protection from it because destitution is [an indication of] a deficiency in religious beliefs, perplexity of intelligence, and it is conducive to hatred of obstinate people."
  },
  {
    "saying_number": 330,
    "saying": "Ask me for understanding but do not ask for confusion because the ignorant person who tries to learn is like the learned man, but the learned man who tries to create confusion is like the ignorant."
  },
  {
    "saying_number": 333,
    "saying": "Woe unto you! You have been harmed by him who deceived you... Satan, the deceiver, and the inner self [nafs] that leads one to evil deceived them through passions. It made it easy for them to get into sins, promised them victory and eventually threw them into the Fire."
  },
  {
    "saying_number": 336,
    "saying": "The age up to which Allah accepts any excuse for a human being is sixty years."
  },
  {
    "saying_number": 337,
    "saying": "One whose sin overpowers him is never victorious, and whoever secures victory by evil means is (in fact) vanquished."
  },
  {
    "saying_number": 338,
    "saying": "All h, the Glorified One, has fixed the livelihood of the destitute in the wealth of the rich. Consequently, whenever a destitute remains hungry, it is because some rich person has denied (him his share). Allah, the Sublime, will question them [the rich] about it."
  },
  {
    "saying_number": 339,
    "saying": "Not to be in need of putting forth an excuse is better than putting forth a true excuse."
  },
  {
    "saying_number": 340,
    "saying": "The least right of Allah on you is that you should not make use of His favors in committing His sins."
  },
  {
    "saying_number": 341,
    "saying": "When the disabled fall short in performing acts of obedience to Allah, the Glorified One, it is a good opportunity given by Allah for the intelligent to perform such acts."
  },
  {
    "saying_number": 342,
    "saying": "The sovereign is the watchman of All h on earth."
  },
  {
    "saying_number": 343,
    "saying": "A believer has a cheerful face, a sorrowful heart, a very broad chest (very generous), and a very humble heart. He hates high status and dislikes fame. His grief is long, his courage is far-reaching, his silence is much and, his time is occupied. He is grateful, enduring, buried in his thoughts, sparing in his friendship (with others), of a bright demeanor and of a soft temperament."
  },
  {
    "saying_number": 344,
    "saying": "If a man happens to see the end of (his) life and his final fate, he will begin hating desires and their deception."
  },
  {
    "saying_number": 345,
    "saying": "There are two shares in the property of every person: heirs and accidents."
  },
  {
    "saying_number": 346,
    "saying": "The person who is approached with a request is free till he makes a promise."
  },
  {
    "saying_number": 347,
    "saying": "Whoever prays but does not exert effort is like one who shoots without a bow-string."
  },
  {
    "saying_number": 348,
    "saying": "Knowledge is of two kinds: that which is absorbed and that which is just heard. The one that is heard does not give benefit unless it is absorbed."
  },
  {
    "saying_number": 349,
    "saying": "Correctness of decisions goes together with power. One emerges with the other’s emergence and disappears when the other disappears."
  },
  {
    "saying_number": 350,
    "saying": "The beauty of destitution is chastity and the beauty of riches is gratitude."
  },
  {
    "saying_number": 351,
    "saying": "The day of justice will be more severe on the oppressor than the day of oppression on the oppressed."
  },
  {
    "saying_number": 352,
    "saying": "The biggest wealth is that one should not have an eye on what others possess."
  },
  {
    "saying_number": 353,
    "saying": "Utterances are preserved and actions are to be tired. “Every soul, for what it earned, is pawned” (Quran, 74: 38). People are to be made deficient (as regarding their bodies) and meddled with (as regarding their minds) except those whom Allah protects."
  },
  {
    "saying_number": 354,
    "saying": "O folks! Fear Allah, for there is many a man who aspires for what he does not get, many a builder of a house who does not live to occupy it, and many a collector of that which he shall just leave behind."
  },
  {
    "saying_number": 355,
    "saying": "Lack of access to sins is also a kind of chastity."
  },
  {
    "saying_number": 356,
    "saying": "The dignity of your face is solid, but begging dissolves it; therefore, look carefully before whom you dissolve it."
  },
  {
    "saying_number": 357,
    "saying": "To praise more than what is due is sycophancy; to do it less is either because of inability to speak or of envy."
  },
  {
    "saying_number": 358,
    "saying": "peace be upon one who keeps away even from minor sins and, hence, his burden is considered light."
  },
  {
    "saying_number": 359,
    "saying": "One who sees his own shortcomings abstains from looking into other’s shortcomings. Whoever feels happy with the livelihood with which Allah provides him does not grieve over what he misses."
  },
  {
    "saying_number": 360,
    "saying": "The oppressor among the people has three signs: He oppresses his superior by disobeying him, and his junior by imposing his authority and he tops other oppressors."
  },
  {
    "saying_number": 361,
    "saying": "At the extremity of hardship comes relief, and at the tightening of the chains of tribulation comes ease."
  },
  {
    "saying_number": 362,
    "saying": "Do not devote much of your activity to your wife and children because if your wife and children are lovers of Allah, then He will not leave His lovers without caring for them. And if they are enemies of Allah, then why should you worry and keep yourself busy about the enemies of Allah?"
  },
  {
    "saying_number": 363,
    "saying": "The greatest defect is when you are concerned about the defect (in others) which is already present in yourself."
  },
  {
    "saying_number": 364,
    "saying": "Do not say so; but say: You have an occasion to be grateful to Allah, the Giver, and be blessed with what you have been given. May he attain full life, and may you be blessed with His devotion."
  },
  {
    "saying_number": 365,
    "saying": "These are silver coins showing their faces. Certainly, this house speaks of your riches."
  },
  {
    "saying_number": 366,
    "saying": "From whatever way his death reaches him."
  },
  {
    "saying_number": 367,
    "saying": "This thing has not started with you nor does it end with you. This fellow of yours was used to journeying and, therefore, it is better to think of him as still journeying. Either he will rejoin you or you will rejoin him."
  },
  {
    "saying_number": 368,
    "saying": "O people! Let Allah see you fearing at the time of happiness just as you fear Him at the time of distress. Certainly, whoever is given ease (of life) and does not consider it as a means of slow approach to tribulation (wrongly) considers himself as safe against what is to be feared..."
  },
  {
    "saying_number": 369,
    "saying": "O slaves of desires! Cut them short because whoever leans on the world gets nothing out of it except the pain of hardships. O people! Take upon yourselves to train your own souls and turn away from the dictates of your natural inclinations."
  },
  {
    "saying_number": 370,
    "saying": "Do not regard an expression uttered by any person as evil if you can find it capable of bearing some good."
  },
  {
    "saying_number": 371,
    "saying": "If you have a need from Allah, the Glorified One, then begin by seeking Allah’s blessing on His Messenger, may Allah bless him and his descendants, then ask your need, because Allah is too generous to accept one (seeking His blessing on His Messenger) of the two requests made to Him while denying the other."
  },
  {
    "saying_number": 372,
    "saying": "Whoever is jealous of his esteem should keep from quarreling."
  },
  {
    "saying_number": 373,
    "saying": "To make haste before the proper time or to delay after a proper opportunity, in either case there is folly."
  },
  {
    "saying_number": 374,
    "saying": "Do not ask about things which may not happen because you have enough to worry about with what already happens."
  },
  {
    "saying_number": 375,
    "saying": "Imagination is a clear mirror, and the taking of lessons (from things around you) provides warning and counsel. It is enough for improving yourself that you should avoid what you consider as bad in others."
  },
  {
    "saying_number": 376,
    "saying": "Knowledge is associated with action. Therefore, whoever knows should act [upon it] because knowledge calls for action. If there is a response, well and good; otherwise, it (i.e. knowledge) departs from him."
  },
  {
    "saying_number": 377,
    "saying": "O people! The wealth of this world is broken into sorts that may bring an epidemic; therefore, keep off this grazing land. Leaving it is a greater favor than peacefully staying in it, and its part which suffices for subsistence is more blissful than its riches."
  },
  {
    "saying_number": 378,
    "saying": "All h, the Glorified One, has laid down rewards for obedience to Him and punishment for committing sins against Him in order to save men from His chastisement and to drive them towards Paradise."
  },
  {
    "saying_number": 379,
    "saying": "A time will come when nothing will remain of the Qur’ n except its writing and nothing of Islam except its name. The mosques in such days will be busy with regard to construction but desolate with regard to guidance."
  },
  {
    "saying_number": 380,
    "saying": "O people! Fear Allah, for man has not been created for naught so that he may waste himself, nor has he been left without anyone caring for them so that he may commit foolish acts."
  },
  {
    "saying_number": 381,
    "saying": "There is no distinction higher than Islam, no honor more honorable than fear of Allah, no asylum better than self-restraint, no intercessor more effective than repentance, no treasure more precious than contentment, and no wealth is a bigger remover of destitution than satisfaction with mere subsistence."
  },
  {
    "saying_number": 382,
    "saying": "O Jabir! The mainstay of religion and the world are four persons: The scholar who acts upon his knowledge, the ignorant person who does not feel ashamed of learning, the generous person who is not niggardly in his favors, and the destitute who does not sell his next life for his worldly benefits."
  },
  {
    "saying_number": 383,
    "saying": "O believers, whoever observes excesses being committed and people being called towards evil and disapproves it with his heart is safe and free from responsibility for it, and whoever disapproves of it with his tongue will be rewarded and he is in a higher status than the former..."
  },
  {
    "saying_number": 384,
    "saying": "So..., among them (the Muslim community) there is one who disapproves evil with his hand, tongue and heart. This man has perfectly attained the virtuous habits."
  },
  {
    "saying_number": 385,
    "saying": "The first fighting with which you will be overpowered is fighting with the hands. Thereafter, you will fight with your tongues then with your hearts. Consequently, whoever does not recognize virtue with his heart or does not disprove evil will be turned upside down."
  },
  {
    "saying_number": 386,
    "saying": "Certainly, right is weighty and wholesome while wrong is light and epidemic."
  },
  {
    "saying_number": 387,
    "saying": "Do not feel safe from the punishment of Allah even about the best man in the whole community because Allah, the Sublime, says: “But none feels secure from the plan of Allah save the people (who are the) losers” (Quran, 7: 99)."
  },
  {
    "saying_number": 388,
    "saying": "Miserliness contains all other evil vices and is the rein with which one can be led to every evil."
  },
  {
    "saying_number": 389,
    "saying": "O son of Adam! Livelihood is of two kinds: The livelihood which you seek and the livelihood which seeks you; if you do not reach it, it will reach you. Therefore, do not turn your one day’s worry into a year’s worry."
  },
  {
    "saying_number": 390,
    "saying": "Many a man faces a day after which he finds no day, and many a man is in an enviable status in the earlier part of the night but is mourned by wailing women in its later part."
  },
  {
    "saying_number": 391,
    "saying": "Words are in your control till you have not uttered them. But when you have spoken them, you are under their control. Therefore, guard your tongue as you guard your gold and silver, for often one expression snatches away a blessing and invites a penalty."
  },
  {
    "saying_number": 392,
    "saying": "Do not say what you do not know; rather, do not say all that you know because Allah has laid down some obligations for all your limbs by means of which He will put forth arguments against you on the Day of Judgement."
  },
  {
    "saying_number": 393,
    "saying": "Fear lest Allah should see you committing His sins or misses you when it is time to obey Him and, as a result, you will become a loser. Therefore, when you are strong, be strong in obeying Allah, and when you are weak, be weak in committing sins against Allah."
  },
  {
    "saying_number": 394,
    "saying": "Leaning towards this world despite what you see of it is a folly, and lagging behind in doing good deeds when you are convinced of good reward for them is an obvious loss, while trusting in everyone before trying is a weakness."
  },
  {
    "saying_number": 395,
    "saying": "It is (the proof of the) humbleness of the world before Allah that He is disobeyed only herein and His favors cannot be achieved except by renouncing it."
  },
  {
    "saying_number": 396,
    "saying": "One who is in search of something will obtain it, at least some of it."
  },
  {
    "saying_number": 397,
    "saying": "That good is no good after which there is the Fire, and that hardship is no hardship after which there is Paradise. Every bliss other than Paradise is minor, and every calamity other than the Fire is comfort."
  },
  {
    "saying_number": 398,
    "saying": "Beware that destitution is a calamity, but worse than destitution is ailment of the body, while worse than bodily ailment is the disease of the heart. Beware that plenty of wealth is a blessing, but better than plenty of wealth is the health of the body, while still better than the health of the body is the purity of the heart."
  },
  {
    "saying_number": 401,
    "saying": "Abstain from the world so that All h may show you its real evils, and do not be neglectful because (in any case) you will not be neglected."
  },
  {
    "saying_number": 402,
    "saying": "Speak so that you may be known, since man is hidden under his tongue."
  },
  {
    "saying_number": 403,
    "saying": "Take of the favors of the world whatever comes to you and keep away from what keeps away from you. If you cannot do so, be moderate in your pursuits."
  },
  {
    "saying_number": 404,
    "saying": "Many an expression is more effective than an onslaught."
  },
  {
    "saying_number": 405,
    "saying": "Every small thing that is contented upon suffices."
  },
  {
    "saying_number": 406,
    "saying": "Let it be death but not humiliation. Let it be little but not through others. Whoever does not get while sitting will not get by standing either. The world has two days: one for you and the other against you. When the day is for you, do not feel proud, but when it is against you, endure it."
  },
  {
    "saying_number": 407,
    "saying": "The best scent is musk, its weight is light while its smell is sweet."
  },
  {
    "saying_number": 408,
    "saying": "Put off boasting, give up self-conceit and remember your grave."
  },
  {
    "saying_number": 409,
    "saying": "The child has a right on the father while the father, too, has a right on the child. The right of the father on the child is that the latter should obey the former in every matter save in committing sins against Allah, the Glorified One, while the right of the child on the father is that the latter should give the first a beautiful name, provide him with good training and teach him the Quran."
  },
  {
    "saying_number": 410,
    "saying": "Evil effect of sight is right, charm is right, sorcery is right, and fa’l (auguring good) is right, while tayrah (auguring evil) is not right, and spreading of a disease from one to the other is not right. Scent gives pleasure, honey gives pleasure, riding gives pleasure and looking at greenery gives pleasure."
  },
  {
    "saying_number": 411,
    "saying": "Nearness with people in their manners brings about safety from their evil."
  },
  {
    "saying_number": 412,
    "saying": "You have started flying soon after growing feathers and commenced grumbling before attaining youth."
  },
  {
    "saying_number": 413,
    "saying": "Whoever hankers after contraries gets no means of success."
  },
  {
    "saying_number": 414,
    "saying": "We are not masters of anything along with All h, and we are not masters of anything save what He makes us masters of. So, when He makes us masters of anything of which He is a superior Lord over us, He also assigns some duties to us. And when He takes it away, He takes away those duties as well."
  },
  {
    "saying_number": 415,
    "saying": "Leave him alone, O ‘Amm r, for he has entered religion only to the extent of his deriving advantage of the world, and he has willfully involved himself in misgivings in order to adopt them as cover for his shortcomings."
  },
  {
    "saying_number": 416,
    "saying": "It is good for the rich to show humility before the poor to seek rewards from Allah, but better than that is the pride of the poor towards the rich with trust in Allah."
  },
  {
    "saying_number": 417,
    "saying": "Allah does not grant wisdom to a person except that some day He will save him from ruin with its help."
  },
  {
    "saying_number": 418,
    "saying": "Whoever clashes with the truth will be knocked down by it."
  },
  {
    "saying_number": 419,
    "saying": "The heart is the book of the eye."
  },
  {
    "saying_number": 420,
    "saying": "Fear of Allah is the chief trait of the human character."
  },
  {
    "saying_number": 421,
    "saying": "Do not try the sharpness of your tongue against the One Who gave you the power to speak, nor the eloquence of your speech against the One Who set you on the right path."
  },
  {
    "saying_number": 422,
    "saying": "It is enough for your own discipline that you abstain from what you dislike from others."
  },
  {
    "saying_number": 423,
    "saying": "One should endure like free people; otherwise, one should keep quite like the ignorant."
  },
  {
    "saying_number": 424,
    "saying": "It deceives, it harms and it passes away. Allah, the Sublime, did not approve it as a reward for His lovers nor as a punishment for His enemies. In fact, the people of this world are like those riders that as soon as they descended, the driver called out to them and they marched off."
  },
  {
    "saying_number": 425,
    "saying": "O my son! Do not leave anything of this world behind you because you will be leaving it for either of two sorts of persons: a person who uses it in obeying Allah, in this case he will acquire virtue through what was evil for you, or a person who uses it in disobeying Allah and, in that case, he will be reaping evil with what you collected for him."
  },
  {
    "saying_number": 426,
    "saying": "May your mother may lose you! Do you know what “istighfar” is? “Istighfar” is meant for people of a high status. It is a word that stands on six pillars..."
  },
  {
    "saying_number": 427,
    "saying": "Clemency is (like) kinsfolk."
  },
  {
    "saying_number": 428,
    "saying": "How wretched the son of Adam is! His death is hidden, his ailments are concealed, his actions are preserved, the bite of a mosquito pains him, choking cause his death and sweat gives him a bad smell."
  },
  {
    "saying_number": 429,
    "saying": "The eyes of these men are covetous, and such glances are the cause of their becoming covetous. Whenever anyone of you sees a woman who attracts him, he should meet his wife [for cohabitation] because she is a woman just like his wife."
  },
  {
    "saying_number": 430,
    "saying": "Suffices you if your wisdom distinguishes for you the ways of going astray from those of guidance."
  },
  {
    "saying_number": 431,
    "saying": "Do good and do not regard any part of it small because its small is big and its little is much. None of you should say that “Another person is more deserving than me” in doing good."
  },
  {
    "saying_number": 432,
    "saying": "Whoever mends his inward self, Allah mends his outward self. Whoever performs acts for the sake of his religion, Allah accomplishes his acts of this world. Anyone whose dealings between himself and Allah are good, Allah turns the dealings between him and other people good, too."
  },
  {
    "saying_number": 433,
    "saying": "Forbearance is a covering curtain, and wisdom is a sharp sword. Therefore, conceal the weaknesses in your conduct with forbearance and kill your desires with your wisdom."
  },
  {
    "saying_number": 434,
    "saying": "There are some creatures of All h whom Allah particularly chooses for His favors so that they may be of benefit to other people. Therefore, He keeps such favors in their hands so long as they give them out to others."
  },
  {
    "saying_number": 435,
    "saying": "It does not behoove a man to have trust in two things: health and riches, because there is many a man whom you see healthy but he soon falls and many a man whom you see rich but soon turns destitute."
  },
  {
    "saying_number": 436,
    "saying": "Whoever complains about a need to a believer, it is as though he has complained about it to Allah. But whoever complains about it to an unbeliever, it is as though he complained about Allah."
  },
  {
    "saying_number": 437,
    "saying": "It is an ‘Id for anyone whose fast is accepted by Allah and for whose prayers He is grateful, and (in fact) every day wherein no sin against Allah is committed is an ‘Id."
  },
  {
    "saying_number": 438,
    "saying": "On the Day of Judgement, the greatest regret will be felt by the man who earned wealth through sinful ways, although it is inherited by a person who spends it in obeying Allah, the Glorified One, and he will be awarded Paradise on that account while the first one will be dragged into the Fire on its account."
  },
  {
    "saying_number": 439,
    "saying": "The worst in bargaining and the most unsuccessful in striving is a man who exerts himself in seeking riches although fate does not help him in his aims and, consequently, he goes from this world in a sorrowful state while in the next world, too, he will face its ill consequences."
  },
  {
    "saying_number": 440,
    "saying": "Livelihood is of two kinds: the seeker and the sought. Therefore, whoever hankers after this world, death traces him till it turns him out of it. But whoever hankers after the next world, worldly ease itself seeks him till he receives his livelihood from it."
  },
  {
    "saying_number": 441,
    "saying": "The lovers of Allah are those who look at the inward side of the world, while the other people look at its outward side. They occupy themselves with its most remote benefits while the other people occupy themselves with the immediate benefits."
  },
  {
    "saying_number": 442,
    "saying": "Remember that pleasures will pass away while the consequences will stay."
  },
  {
    "saying_number": 443,
    "saying": "Try (a man) and you will hate him!"
  },
  {
    "saying_number": 444,
    "saying": "It is not that Allah, to Whom belongs Might and Majesty, may keep the door of gratitude open for a person and close the door of plenty upon him, or to open the door of prayer to a person and close the door of acceptance upon him..."
  },
  {
    "saying_number": 445,
    "saying": "The most appropriate person for an honorable status is whoever descends from the people of honor."
  },
  {
    "saying_number": 446,
    "saying": "Justice puts things in their places while generosity takes them out from their directions. Justice is the general caretaker, while generosity is a particular benefit. Consequently, justice is superior and more distinguished of the two."
  },
  {
    "saying_number": 447,
    "saying": "People are enemies of what they do not know."
  },
  {
    "saying_number": 448,
    "saying": "The whole of asceticism is confined between two expressions of the Quran: Allah, the Glorified One, says: “... lest you should distress yourselves because of what you miss and be over-joyous for what He has granted you” (Quran, 57: 23). Whoever does not grieve over what he misses and does not revel over what comes to him acquires asceticism from both its sides."
  },
  {
    "saying_number": 449,
    "saying": "What a breaker is sleep for the resolutions of the day!"
  },
  {
    "saying_number": 450,
    "saying": "Governing power is the proving ground for people."
  },
  {
    "saying_number": 451,
    "saying": "No town has a greater right on you than the other. The best town for you is that which bears you."
  },
  {
    "saying_number": 452,
    "saying": "Malik, what a man Malik was! By Allah! If he had been a mountain, he would have been a big one (a find), and if he had been a stone, he would have been quite stiff. No horseman could have reached it and no bird could have flown over it."
  },
  {
    "saying_number": 453,
    "saying": "A little that lasts is better than much that brings grief."
  },
  {
    "saying_number": 454,
    "saying": "If a man possesses a revealing quality, wait and see his other qualities."
  },
  {
    "saying_number": 455,
    "saying": "That is the most praiseworthy way of (losing) them."
  },
  {
    "saying_number": 456,
    "saying": "Whoever trades without knowing the rules of religious law will be involved in usury."
  },
  {
    "saying_number": 457,
    "saying": "Whoever regards small distresses as big, All h involves him in big ones."
  },
  {
    "saying_number": 458,
    "saying": "Whoever maintains his own respect in view, his desires appear light to him."
  },
  {
    "saying_number": 459,
    "saying": "Whenever a man cuts a joke, he separates himself away a bit from his wit."
  },
  {
    "saying_number": 463,
    "saying": "What has a man to do with vanity? His origin is semen, his end is a carcass, while he cannot feed himself nor ward off death?"
  },
  {
    "saying_number": 464,
    "saying": "Imam Ali ibn Abu Talib ( ) was asked who the greatest poet was. He said: “Any group of them that did not proceed on the same lines in such a way that we can know the height of their glory, but if it has to be done, then it is ‘al-Malik ad-Dillil’.”"
  },
  {
    "saying_number": 465,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Is there no free man who can leave this chewed morsel (of the world) to those who like it? Certainly, the only price for your souls is Paradise. Therefore, do not sell your soul except for Paradise."
  },
  {
    "saying_number": 466,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Two greedy persons never get satisfied: the seeker of knowledge and the seeker of this world."
  },
  {
    "saying_number": 467,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Belief means that you should prefer truth (even) when it harms you rather than falsehood (even) when it benefits you, that your words should not be more than your action and that you should fear All h when speaking about others."
  },
  {
    "saying_number": 468,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Destiny holds sway over (our) predetermination till effort itself brings about ruin."
  },
  {
    "saying_number": 469,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Forbearance and endurance are twins and they are the product of high courage."
  },
  {
    "saying_number": 470,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Backbiting is the tool of the helpless."
  },
  {
    "saying_number": 471,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Many a man gets into mischief because of being spoken well of."
  },
  {
    "saying_number": 472,
    "saying": "Imam Ali ibn Abu Talib ( ) said: This world has been created for other than itself and has not been created for itself."
  },
  {
    "saying_number": 473,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Banu Umayyah (the Umayyads) have a fixed period (mirwad) wherein they are having their way. But when differences arise among them, even if the hyena attacks them, it will overpower them."
  },
  {
    "saying_number": 474,
    "saying": "Eulogizing the Ansar, Imam Ali ibn Abu Talib ( ) said: By Allah, they nurtured Islam with their generous hands and eloquent tongues as a year-old calf is nurtured."
  },
  {
    "saying_number": 475,
    "saying": "Imam Ali ibn Abu Talib ( ) said: The eye is the strap of the rear."
  },
  {
    "saying_number": 476,
    "saying": "Imam Ali ibn Abu Talib ( ) said in one of his speeches: A ruler came to power over them. He remained upright and made them upright till the entire religion put its bosom on the ground."
  },
  {
    "saying_number": 477,
    "saying": "Imam Ali ibn Abu Talib ( ) said: A severe time will come to people wherein the rich will seize their possessions with their teeth (by way of miserliness) although they have not been commanded to do so. Allah, the Glorified One, says: “Do not forget generosity among yourselves” (Quran, 2: 237). During this time, the wicked will rise up while the virtuous will remain low. Purchases will be made from the helpless, although the Prophet ( )  has prohibited purchasing from the helpless."
  },
  {
    "saying_number": 478,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Two types of persons will fall into ruin on my account: One who loves me and exaggerates, and the other who lays on me false and baseless blames."
  },
  {
    "saying_number": 479,
    "saying": "Imam Ali ibn Abu Talib ( ) was asked about the Unity of Allah (Tawhid) and His justice (Adl). He replied: Unity means that you do not subject Him to the limitations of your imagination, while justice means that you do not lay any blame on Him."
  },
  {
    "saying_number": 480,
    "saying": "Imam Ali ibn Abu Talib ( ) said: There is no good in silence about matters involving wisdom just as there is no good in speaking with ignorance."
  },
  {
    "saying_number": 481,
    "saying": "Imam Ali ibn Abu Talib ( ) said the following in his prayer for rain: “O Lord! Send us rain by submissive clouds, not by unruly ones.”"
  },
  {
    "saying_number": 482,
    "saying": "It was said to Imam Ali ibn Abu Talib ( ): “We wish you had changed your gray hair, O Imam Ali ibn Abu Talib ( )!” He said: “Dye is a way of adornment, whereas we are in a state of grief.”"
  },
  {
    "saying_number": 483,
    "saying": "Imam Ali ibn Abu Talib ( ) said: The fighter in the way of Allah who gets martyred will not get a greater reward than whoever remains chaste despite means. It is possible that a chaste person may become one of the angels."
  },
  {
    "saying_number": 484,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Contentment is a wealth that is not exhausted."
  },
  {
    "saying_number": 485,
    "saying": "When Imam Ali ibn Abu Talib ( ) put Ziyad ibn Abih in place of ‘Abdullah ibn al-Abbas over Fars (in Persia) and its revenues, he had a long conversation with him in which he prohibited him from advance recovery of revenue. Therein he said: Act upon justice and stay away from violence and injustice because violence will lead them to forsake their abodes while injustice will prompt them to take up arms."
  },
  {
    "saying_number": 486,
    "saying": "Imam Ali ibn Abu Talib ( ) said: The worst sin is that which the one who commits it takes it lightly."
  },
  {
    "saying_number": 487,
    "saying": "Imam Ali ibn Abu Talib ( ) said: Allah has not made it obligatory on the ignorant to learn till He has made it obligatory on the learned to teach."
  },
  {
    "saying_number": 488,
    "saying": "Imam Ali ibn Abu Talib ( ) said: The worst comrade is he for whom formality has to be observed."
  },
  {
    "saying_number": 489,
    "saying": "Imam Ali ibn Abu Talib ( ) said: “If a believer enrages (ihtashama) his brother, it means that he will leave him.”"
  }
]
